
#Область ПрограммныйИнтерфейс

// Возвращает СКД для выгрузки данных документа.
//
// Параметры:
//   ИмяДокумента - Строка - имя документа, как оно задано в конфигураторе.
//
// Возвращаемое значение:
//   СхемаКомпоновкиДанных - СКД для отборов по документу.
//
Функция ПолучитьСКД(ИмяДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса = СформироватьТекстЗапроса(ИмяДокумента);
	СКД = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "local";
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = ИмяДокумента;
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	ПолеСсылка = СКД.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ПолеСсылка.Заголовок = "Ссылка";
	ПолеСсылка.Использование = Истина;
	ПолеСсылка.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
	
	ГруппировкаСКД = СКД.НастройкиПоУмолчанию.Структура.Добавить(тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаСКД.Использование = Истина;
	
	АвтоВыбранныеполя = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоВыбранныеполя.Использование = Истина;
	
	ВыбранныеполяПорядка=ГруппировкаСКД.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	ВыбранныеполяПорядка.Использование = Истина;
	
	
	МассивСтрок = СтрРазделить(ИмяДокумента, ".");
	ИмяДок = МассивСтрок[1];
	ПараметрСсылка = СКД.Параметры.Добавить();
	ПараметрСсылка.Имя = "ПараметрСсылка";
	ПараметрСсылка.Заголовок = " Ссылка на документ";
	ПараметрСсылка.ТипЗначения = Новый ОписаниеТипов("ДокументСсылка." + ИмяДок);
	ПараметрСсылка.ВключатьВДоступныеПоля = Истина;
	ПараметрСсылка.ЗапрещатьНезаполненныеЗначения = Истина;
	ПараметрСсылка.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	
	////// Временно, запись схемы в файл {
	////КаталогДляСохранения = "D:\_РобочіФайлиПрограмістів\Y.Holovatyi\LiteExchange\СКД_ДляОтбораДокументов\";
	////ИмяФайла = СтрЗаменить(ИмяДокумента, ".", "") + ".xml";
	////
	////ЗаписьXML = Новый ЗаписьXML;
	////ЗаписьXML.ОткрытьФайл(КаталогДляСохранения + ИмяФайла);
	////СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 
	////							 СКД, 
	////							 "DataCompositionSchema", 
	////							 "http://v8.1c.ru/8.1/data-composition-system/schema");
	////ЗаписьXML.Закрыть();
	// Временно, запись схемы в файл }
	
	Возврат СКД;
	
КонецФункции // ПолучитьСКД

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает текст запроса по имени документа для вставки в СКД.
//
// Параметры:
//   ИмяДокумента - Строка - имя документа вида "Документ.АвансовыйОтчет".
//
// Возвращаемое значение:
//   Строка - текст запроса по всем реквизитам выбранного документа.
//
Функция СформироватьТекстЗапроса(Знач ИмяДокумента) Экспорт
	
	МассивСтрок = СтрРазделить(ИмяДокумента, ".");
	ИмяДок = МассивСтрок[1];
	
	РеквизитыЗапроса = "";
	ОбъектМетаданных = Метаданные.Документы.Найти(ИмяДок);
	
	Для Каждого СтРеквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		РеквизитыЗапроса = РеквизитыЗапроса + ?(РеквизитыЗапроса = "", "", ", " + Символы.ПС) + " ОБ." + СтРеквизит.Имя + " КАК " + СтРеквизит.Имя;	
	КонецЦикла;
	
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		РеквизитыЗапроса =  РеквизитыЗапроса + ?(РеквизитыЗапроса = "", "", ", " + Символы.ПС) + " ОБ." + Реквизит.Имя + " КАК " + Реквизит.Имя;
	КонецЦикла;
	
	Для каждого ТабЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		Если ТабЧасть.Реквизиты.Количество() = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		СтрТабЧасть = "ОБ." + ТабЧасть.Имя + ".(" + Символы.ПС
		+ "%1" + Символы.ПС + ") КАК " + ТабЧасть.Имя;
		
		РеквизитыТабЧасти = "НомерСтроки КАК НомерСтроки";
		Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл
			
			РеквизитыТабЧасти = РеквизитыТабЧасти + ", " + Символы.ПС + Реквизит.Имя + " КАК " + Реквизит.Имя;
			
		КонецЦикла;
		
		СТрТабЧасть = СтрШаблон(СТрТабЧасть, РеквизитыТабЧасти);
		РеквизитыЗапроса = РеквизитыЗапроса + ", " + Символы.ПС + СтрТабЧасть;
		
	КонецЦикла;
	
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + Символы.ПС + РеквизитыЗапроса + Символы.ПС + " ИЗ " + ИмяДокумента + " КАК ОБ "
	+ Символы.ПС + "ГДЕ ОБ.Ссылка = &ПараметрСсылка";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти


// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("НастройкаОбмена");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()
