
Функция РежимОтладки() Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти("ОбщегоНазначения") = Неопределено Тогда
		Возврат Истина;
	Иначе
		Результат = Ложь;
		Выполнить("Результат = ОбщегоНазначения.РежимОтладки()");
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНастройки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.леНастройкиТранспортаОбменаДанными КАК леНастройкиТранспортаОбменаДанными";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции