
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		ЗначениеИсточник = Строка(Источник);
		ЗначениеПриемник = Строка(Приемник);
		
	КонецЕсли;

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = СМП_ОбщегоНазначения.глНаименованиеПКЗ(ЭтотОбъект);
	КонецЕсли;

	Если Порядок = 0 Тогда
		Порядок = СМП_ОбщегоНазначения.ОчереднойПорядок("ПравилаКонвертацииЗначений", Родитель, Владелец);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СгенерироватьУникальныйКод() Экспорт
	УстановитьНовыйКод();
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';uk='Неприпустимий виклик об`єкту на клієнті.'");
#КонецЕсли
