
#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьСообщение(Команда)

	ТекСтрока = Элементы.Список.ТекущиеДанные;
	ОбработатьСообщениеНаСервере(ТекСтрока.УчетнаяЗаписьОбмена, ТекСтрока.УникальныйИдентификатор);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Запускает процес отправки сообщения.
//
// Параметры:
//   Учетнаязаписьобмена - СправочникСсылка.СМП_УчетныеЗаписиОбменов - учетная запись в рамках которой обрабатывается сообщение.
//   ИдентификаторСообщения - Строка - уникальный идентификатор сообщения.
//
&НаСервереБезКонтекста
Процедура ОбработатьСообщениеНаСервере(УчетнаяЗаписьОбмена, ИдентификаторСообщения) 
	
	СМП_ОнлайнОбменУправлениеОчередями.ОтправитьСообщение(УчетнаяЗаписьОбмена, ИдентификаторСообщения);
	
КонецПроцедуры //ОбработатьСообщениеНаСервере


#КонецОбласти