
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ОбработатьСообщениеНаСервере(Элементы.Список.ТекущиеДанные.УчетнаяЗаписьОбмена, Элементы.Список.ТекущиеДанные.УникальныйИдентификатор);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Запускает процес отправки сообщения.
//
// Параметры:
//   ИдентификаторСообщения - Строка - уникальный идентификатор сообщения.
//   УчетнаяЗаписьОбмена - СправочникСсылка.СМП_УчетныеЗаписиОбменов - обмен данными в рамках которого отправляется сообщение.
//
&НаСервереБезКонтекста
Процедура ОбработатьСообщениеНаСервере(УчетнаяЗаписьОбмена, ИдентификаторСообщения) 
	
	// Отладка
	СМП_ОнлайнОбмен.ВыполнитьОтправкуИсходящихСообщений(, УчетнаяЗаписьОбмена, ИдентификаторСообщения,,, Истина);
	
КонецПроцедуры //ОбработатьСообщениеНаСервере

#КонецОбласти