#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьПараметрыВыбораРеквизита();

	ВидВыражение = ЭтоВидВыражение(Объект.Вид);
	Элементы.Выражение.Видимость = ВидВыражение;
	Элементы.Реквизит.Видимость = Не ВидВыражение;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПриИзменении(Элемент)

	УстановитьВидимость();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыВыбораРеквизита()

	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец",
		СМП_ОнлайнОбменСверка.ОбъектСвоейБазы(Объект.Владелец)));
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Вид", Перечисления.СМП_ВидыСвойств.Реквизит));
	Элементы.Реквизит.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоВидВыражение(Вид)

	Возврат Вид = ПредопределенноеЗначение("Перечисление.СМП_ВидыПоказателейСверки.Выражение");

КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()

	ВидВыражение = ЭтоВидВыражение(Объект.Вид);
	Элементы.Выражение.Видимость = ВидВыражение;
	Элементы.Реквизит.Видимость = Не ВидВыражение;

КонецПроцедуры

#КонецОбласти
