#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыВыбораРеквизита();
	УстановитьВидимость(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	УстановитьВидимость(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыВыбораРеквизита()
	
	мПараметрыВыбора = Новый Массив;
	мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец",
	СМП_ОнлайнОбменСверка.ОбъектСвоейБазы(Объект.Владелец)));
	мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Вид", Перечисления.СМП_ВидыСвойств.Реквизит));
	Элементы.Реквизит.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоВидВыражение(Вид)
	
	Возврат Вид = ПредопределенноеЗначение("Перечисление.СМП_ВидыПоказателейСверки.Выражение");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Форма)
	
	ВидВыражение = ЭтоВидВыражение(Форма.Объект.Вид);
	Форма.Элементы.Выражение.Видимость = ВидВыражение;
	Форма.Элементы.Реквизит.Видимость = Не ВидВыражение;
	
КонецПроцедуры

#КонецОбласти
