#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Извлекает данные о конвертации из файла правил конвертации XML.
// Параметры:
//   ОбщиеПеременные - Структура - Переменные, которые используются при работе.
//   АдресВременногоХранилища - Произвольный - Адрес, в который будет помещен результат выполнения процедуры.
Процедура ПолучитьДанныеКонвертацииИзФайла(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	ФлагОшибки = Ложь;
	РезультатЗагрузки = Новый Структура("ЗагрузкаШапки, Успешно", Истина, Истина);
	ФайлЗапакован = Ложь;
	ИмяФайлаДляЧтенияДанных = ПолучитьИмяФайлаДляЧтенияДанных(ОбщиеПеременные, ФайлЗапакован, ФлагОшибки);
	Если ФлагОшибки Тогда
		РезультатЗагрузки.Успешно = Ложь;
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
		Возврат;
	КонецЕсли;
	ПравилаОбмена = Новый ЧтениеXML();
	ПравилаОбмена.ОткрытьФайл(ИмяФайлаДляЧтенияДанных);
	ПравилаОбмена.Прочитать();
	
	Стек = Новый Массив;
	
	Если Не ((ПравилаОбмена.ЛокальноеИмя = "ПравилаОбмена") И (ПравилаОбмена.ТипУзла = ТипУзлаXML.НачалоЭлемента)) Тогда
		РезультатЗагрузки.Успешно = Ложь;
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
		Возврат;
	Иначе
		Стек.Добавить(ПравилаОбмена.ЛокальноеИмя);
	КонецЕсли;
	
	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если      ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Стек.Добавить(ИмяУзла);
			Если      (ИмяУзла = "Наименование") И (Стек[Стек.Количество() - 2] = "ПравилаОбмена") Тогда
				РезультатЗагрузки.Вставить("Наименование", одЗначениеЭлемента(ПравилаОбмена));
				Стек.Удалить(Стек.Количество() - 1);
			ИначеЕсли (ИмяУзла = "Источник") И (Стек[Стек.Количество() - 2] = "ПравилаОбмена") Тогда
				РезультатЗагрузки.Вставить("Источник", одЗначениеЭлемента(ПравилаОбмена));
				Стек.Удалить(Стек.Количество() - 1);
			ИначеЕсли (ИмяУзла = "Приемник") И (Стек[Стек.Количество() - 2] = "ПравилаОбмена") Тогда
				РезультатЗагрузки.Вставить("Приемник", одЗначениеЭлемента(ПравилаОбмена));
				Стек.Удалить(Стек.Количество() - 1);
			КонецЕсли;
		ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Стек.Удалить(Стек.Количество() - 1);
		КонецЕсли;

		Если РезультатЗагрузки.Количество() = 5 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ПравилаОбмена.Закрыть();
	
	Если ФайлЗапакован Тогда
		Попытка
			УдалитьФайлы(ИмяФайлаДляЧтенияДанных);
		Исключение
			ИмяФайлаДляЧтенияДанных = "";
		КонецПопытки;
	КонецЕсли;
	Если РезультатЗагрузки.Свойство("Наименование") Тогда
		НайденнаяКонвертация = Справочники.СМП_УчетныеЗаписиОбменов.НайтиПоНаименованию(СокрЛП(РезультатЗагрузки.Наименование), Истина);
		Если ЗначениеЗаполнено(НайденнаяКонвертация) Тогда
			ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НайденнаяКонвертация, "Источник,ТипКонвертации");
			Если ДанныеКонвертации.ТипКонвертации = Перечисления.ТипыКонвертаций.XML Тогда
				РезультатЗагрузки.Вставить("Конвертация", НайденнаяКонвертация);
				РезультатЗагрузки.Вставить("Конфигурация", ДанныеКонвертации.Источник);
			Иначе
				РезультатЗагрузки.Вставить("Наименование", РезультатЗагрузки.Наименование + " (XML)");
			КонецЕсли
			//ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НайденнаяКонвертация, "Конфигурация,КонфигурацияКорреспондент, ТипКонвертации");
			//Если ДанныеКонвертации.ТипКонвертации = Перечисления.ТипыКонвертаций.XML Тогда
			//	РезультатЗагрузки.Вставить("Конвертация", НайденнаяКонвертация);
			//	РезультатЗагрузки.Вставить("Конфигурация", ДанныеКонвертации.Конфигурация);
			//	РезультатЗагрузки.Вставить("КонфигурацияКорреспондент", ДанныеКонвертации.КонфигурацияКорреспондент);
			//Иначе
			//	РезультатЗагрузки.Вставить("Наименование", РезультатЗагрузки.Наименование + " (XML)");
			//КонецЕсли
		КонецЕсли;
	КонецЕсли;
	Если НЕ РезультатЗагрузки.Свойство("Конфигурация") И РезультатЗагрузки.Свойство("Источник") Тогда
		НайденнаяКонфигурация = Справочники.Релизы.НайтиПоРеквизиту("Имя", СокрЛП(РезультатЗагрузки.Источник));
		Если ЗначениеЗаполнено(НайденнаяКонфигурация) Тогда
			РезультатЗагрузки.Вставить("Конфигурация", НайденнаяКонфигурация);
		КонецЕсли;
	КонецЕсли;
	//Если НЕ РезультатЗагрузки.Свойство("КонфигурацияКорреспондент") И РезультатЗагрузки.Свойство("Приемник") Тогда
	//	НайденнаяКонфигурация = Справочники.Релизы.НайтиПоРеквизиту("Имя", СокрЛП(РезультатЗагрузки.Приемник));
	//	Если ЗначениеЗаполнено(НайденнаяКонфигурация) Тогда
	//		РезультатЗагрузки.Вставить("КонфигурацияКорреспондент", НайденнаяКонфигурация);
	//	КонецЕсли;
	//КонецЕсли; 
	ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
КонецПроцедуры

// Выполняет загрузку правил конвертации XML из файла.
// Параметры:
//   ОбщиеПеременные - Структура - Переменные, которые используются при загрузке.
//   АдресВременногоХранилища - Произвольный - Адрес, в который будет помещен результат выполнения загрузки.
Процедура ВыполнитьЗагрузкуПравил(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	
	ФлагОшибки = Ложь;
	ФайлЗапакован = Ложь;
	РезультатЗагрузки = Новый Структура("ЗагрузкаШапки, Успешно", Ложь, Истина);
	ИмяФайлаДляЧтенияДанных = ПолучитьИмяФайлаДляЧтенияДанных(ОбщиеПеременные, ФайлЗапакован, ФлагОшибки);
	Если ФлагОшибки Тогда
		РезультатЗагрузки.Успешно = Ложь;
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
		Возврат;
	КонецЕсли;

	ОбщиеПеременные.Вставить("мТаблицаПравилКонвертацииСвойств", Новый ДеревоЗначений);
	ИнициализацияТаблицыПКС(ОбщиеПеременные.мТаблицаПравилКонвертацииСвойств);
	
	ОбщиеПеременные.Вставить("мТаблицаПравилКонвертацииЗначений", Новый ДеревоЗначений);
	ИнициализацияТаблицыПКЗ(ОбщиеПеременные.мТаблицаПравилКонвертацииЗначений);
	
	ОбщиеПеременные.Вставить("мТаблицаНастроекВариантовПоиска", Новый ДеревоЗначений);
	ИнициализацияТаблицуНастроекВариантовПоиска(ОбщиеПеременные.мТаблицаНастроекВариантовПоиска);
	
	ОбщиеПеременные.Вставить("Конвертация", Новый Структура);
	ОбщиеПеременные.Вставить("ФлагОшибки", Ложь);
	ОбщиеПеременные.Вставить("мПКОДляПКС", Новый Соответствие);
	ОбщиеПеременные.Вставить("мВсеПравилаКонвертации", Новый Соответствие);

	ИнициализацияТаблицыПКО(ОбщиеПеременные);
	ИнициализацияТаблицыАлгоритмов(ОбщиеПеременные);
	
	ПравилаОбмена = Новый ЧтениеXML();
	ПравилаОбмена.ОткрытьФайл(ИмяФайлаДляЧтенияДанных);
	ПравилаОбмена.Прочитать();
	Если ПравилаОбмена.ЛокальноеИмя <> "ПравилаОбмена" 
		И ПравилаОбмена.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
		РезультатЗагрузки.Успешно = Ложь;
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
		Возврат;
	КонецЕсли;
	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		// Реквизиты конвертации		
		Если      ИмяУзла = "ВерсияФормата" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ВерсияФормата",        одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));			
			РежимСовместимости = ПравилаОбмена.ПолучитьАтрибут ("РежимСовместимости");
			Если РежимСовместимости <> Неопределено Тогда
				ОбщиеПеременные.Конвертация.Вставить("РежимСовместимости", РежимСовместимости)
			КонецЕсли;
		ИначеЕсли ИмяУзла = "Ид" Тогда
			ОбщиеПеременные.Конвертация.Вставить("Ид",                   одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			ОбщиеПеременные.Конвертация.Вставить("Наименование",         одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
		ИначеЕсли ИмяУзла = "ДатаВремяСоздания" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ДатаВремяСоздания",    одЗначениеЭлемента(ПравилаОбмена, Тип("Дата")));
		ИначеЕсли ИмяУзла = "УдалятьСопоставленныеОбъектыВПриемникеПриИхУдаленииВИсточнике" Тогда
			ОбщиеПеременные.Конвертация.Вставить("УдалятьСопоставленныеОбъектыВПриемникеПриИхУдаленииВИсточнике",    одЗначениеЭлемента(ПравилаОбмена, Тип("Булево")));		
		ИначеЕсли ИмяУзла = "Источник" Тогда
			Если одАтрибут(ПравилаОбмена, Тип("Строка"), "ВерсияПлатформы") = "7.7" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ИсточникВерсияПлатформы", Перечисления.Приложения.Предприятие77);
			ИначеЕсли одАтрибут(ПравилаОбмена, Тип("Строка"), "ВерсияПлатформы") = "8.0" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ИсточникВерсияПлатформы", Перечисления.Приложения.Предприятие80);
			ИначеЕсли одАтрибут(ПравилаОбмена, Тип("Строка"), "ВерсияПлатформы") = "УП" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ИсточникВерсияПлатформы", Перечисления.Приложения.УправляемоеПриложение);
			КонецЕсли;
			
			ВерсияКонфигурации = одАтрибут(ПравилаОбмена, Тип("Строка"), "ВерсияКонфигурации");
			ОбщиеПеременные.Конвертация.Вставить("ИсточникВерсияКонфигурации", ВерсияКонфигурации);
			
			СинонимКонфигурации = одАтрибут(ПравилаОбмена, Тип("Строка"), "СинонимКонфигурации");
			ОбщиеПеременные.Конвертация.Вставить("ИсточникСинонимКонфигурации", СинонимКонфигурации);
						
			ОбщиеПеременные.Конвертация.Вставить("Источник",             одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			
            Если      одАтрибут(ПравилаОбмена, Тип("Строка"), "ВерсияПлатформы") = "7.7" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ПриемникВерсияПлатформы", Перечисления.Приложения.Предприятие77);
			ИначеЕсли одАтрибут(ПравилаОбмена, Тип("Строка"), "ВерсияПлатформы") = "8.0" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ПриемникВерсияПлатформы", Перечисления.Приложения.Предприятие80);
			ИначеЕсли одАтрибут(ПравилаОбмена, Тип("Строка"), "ВерсияПлатформы") = "УП" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ПриемникВерсияПлатформы", Перечисления.Приложения.УправляемоеПриложение);
			КонецЕсли;
			
			ВерсияКонфигурации = одАтрибут(ПравилаОбмена, Тип("Строка"), "ВерсияКонфигурации");
			ОбщиеПеременные.Конвертация.Вставить("ПриемникВерсияКонфигурации", ВерсияКонфигурации);
			
			СинонимКонфигурации = одАтрибут(ПравилаОбмена, Тип("Строка"), "СинонимКонфигурации");
			ОбщиеПеременные.Конвертация.Вставить("ПриемникСинонимКонфигурации", СинонимКонфигурации);
			
			ОбщиеПеременные.Конвертация.Вставить("Приемник",             одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "РежимСовместимости" Тогда
			ОбщиеПеременные.Конвертация.Вставить("РежимСовместимости", одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
		ИначеЕсли ИмяУзла = "Параметры" Тогда
			одПропустить(ПравилаОбмена);
			//ЗагрузитьПараметры(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Ответственный" Тогда
			одПропустить(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ОсновнойПланОбмена" Тогда
			одПропустить(ПравилаОбмена);

		// События конвертации
		
		ИначеЕсли ИмяУзла = "" Тогда
		
		ИначеЕсли ИмяУзла = "ПослеЗагрузкиПравилОбмена" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеЗагрузкиПравилОбмена",  одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
		
		ИначеЕсли ИмяУзла = "ПередВыгрузкойДанных" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПередВыгрузкойДанных",     одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПослеВыгрузкиДанных" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеВыгрузкиДанных",      одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПередЗагрузкойДанных" Тогда
            ОбщиеПеременные.Конвертация.Вставить("ПередЗагрузкойДанных",     одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПослеЗагрузкиДанных" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеЗагрузкиДанных",      одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПередВыгрузкойОбъекта" Тогда
            ОбщиеПеременные.Конвертация.Вставить("ПередВыгрузкойОбъекта",    одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПередКонвертациейОбъекта" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПередКонвертациейОбъекта", одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));

		ИначеЕсли ИмяУзла = "ПослеВыгрузкиОбъекта" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеВыгрузкиОбъекта", одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПередЗагрузкойОбъекта" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПередЗагрузкойОбъекта", одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПослеЗагрузкиОбъекта" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеЗагрузкиОбъекта", одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПередОтправкойИнформацииОбУдалении" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПередОтправкойИнформацииОбУдалении",  одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПриПолученииИнформацииОбУдалении" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПриПолученииИнформацииОбУдалении",  одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПередПолучениемИзмененныхОбъектов" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПередПолучениемИзмененныхОбъектов",  одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
			
		ИначеЕсли ИмяУзла = "ПослеПолученияИнформацииОбУзлахОбмена" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеПолученияИнформацииОбУзлахОбмена",  одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));						
			
		ИначеЕсли ИмяУзла = "ПослеЗагрузкиПараметров" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеЗагрузкиПараметров",  одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));			
			
		ИначеЕсли ИмяУзла = "ПравилаВыгрузкиДанных" Тогда
			одПропустить(ПравилаОбмена);
			//ЗагрузитьПравилаВыгрузки(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ПравилаКонвертацииОбъектов" Тогда
			ЗагрузитьПравилаКонвертации(ОбщиеПеременные, ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ПравилаРегистрацииОбъектов" Тогда
			одПропустить(ПравилаОбмена); // правила регистрации загружаем отдельной обработкой
			
		ИначеЕсли ИмяУзла = "ПравилаОчисткиДанных" Тогда
			одПропустить(ПравилаОбмена);
			//ЗагрузитьПравилаОчистки(ПравилаОбмена);
        		
		ИначеЕсли ИмяУзла = "Алгоритмы" Тогда
			ЗагрузитьАлгоритмы(ОбщиеПеременные, ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Запросы" Тогда
			одПропустить(ПравилаОбмена);
			//ЗагрузитьЗапросы(ПравилаОбмена);
        ИначеЕсли ИмяУзла = "Обработки" Тогда
			одПропустить(ПравилаОбмена);
			//ЗагрузитьОбработки(ПравилаОбмена);
		ИначеЕсли (ИмяУзла = "ПравилаОбмена") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			ПравилаОбмена.Закрыть();
			Прервать;
		Иначе
 			// Ошибка формата
			ОбщиеПеременные.ФлагОшибки = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка формата файла обмена. Не возможности обработать узел'") + ": " + ИмяУзла);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ОбщиеПеременные.ФлагОшибки Тогда
		// Сохранение загруженных данных в объекты информационной базы.
		Сохранить(ОбщиеПеременные);
	КонецЕсли;
	Если ФайлЗапакован Тогда
		Попытка
			УдалитьФайлы(ИмяФайлаДляЧтенияДанных);
		Исключение
			ИмяФайлаДляЧтенияДанных = "";
		КонецПопытки
	КонецЕсли;
	РезультатЗагрузки.Успешно = НЕ ОбщиеПеременные.ФлагОшибки;
	ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА СО СТРОКАМИ

// Разбирает строку на две части: до подстроки разделителя и после.
//
// Параметры:
//  Стр          - разбираемая строка;
//  Разделитель  - подстрока-разделитель:
//  Режим        - 0 - разделитель в возвращаемые подстроки не включается;
//                 1 - разделитель включается в левую подстроку;
//                 2 - разделитель включается в правую подстроку.
//
// Возвращаемое значение:
//  Правая часть строки - до символа-разделителя.
// 
Функция ОтделитьРазделителем(Стр, Знач Разделитель, Режим=0)

	ПраваяЧасть         = "";
	ПозРазделителя      = Найти(Стр, Разделитель);
	ДлинаРазделителя    = СтрДлина(Разделитель);
	Если ПозРазделителя > 0 Тогда
		ПраваяЧасть	 = Сред(Стр, ПозРазделителя + ?(Режим=2, 0, ДлинаРазделителя));
		Стр          = СокрЛП(Лев(Стр, ПозРазделителя - ?(Режим=1, -ДлинаРазделителя + 1, 1)));
	КонецЕсли;

	Возврат(ПраваяЧасть);

КонецФункции // ОтделитьРазделителем()

// Преобразует значения из строки в массив, используя указанный разделитель
//
// Параметры:
//  Стр            - Разбираемая строка
//  Разделитель    - подстрока разделитель
//
// Возвращаемое значение:
//  Массив значений
// 
Функция МассивИзСтроки(Знач Стр, Разделитель=",")

	Массив      = Новый Массив;
	ПраваяЧасть = ОтделитьРазделителем(Стр, Разделитель);
	
	Пока Не ПустаяСтрока(Стр) Цикл
		Массив.Добавить(СокрЛП(Стр));
		Стр         = ПраваяЧасть;
		ПраваяЧасть = ОтделитьРазделителем(Стр, Разделитель);
	КонецЦикла; 

	Возврат(Массив);
	
КонецФункции // МассивИзСтроки() 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАГРУЗКИ ПРАВИЛ ОБМЕНА

// Осуществляет загрузку правил конвертации объектов
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьПравилаКонвертации(ОбщиеПеременные, ПравилаОбмена)

	ОбщиеПеременные.ТабПКО.Строки.Очистить();
	//мОбщееКоличествоЗагруженныхПКО = 0;

	СтрокиДЗ = ОбщиеПеременные.ТабПКО.Строки;

	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Правило" Тогда
   			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКО(ОбщиеПеременные, ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли ИмяУзла = "Группа" Тогда
            СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКГО(ОбщиеПеременные, ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "ПравилаКонвертацииОбъектов") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ЗагрузитьПравилаКонвертации() 

// Осуществляет загрузку группы правил выгрузки данных в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  НоваяСтрока    - строка дерева значений, описывающая группу правил выгрузки данных
// 
Процедура ЗагрузитьПКГО(ОбщиеПеременные, ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.ЭтоГруппа = Истина;
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
			
		ИначеЕсли ИмяУзла = "Правило" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПКО(ОбщиеПеременные, ПравилаОбмена, СтрокаДЗ);
			
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПКГО(ОбщиеПеременные, ПравилаОбмена, СтрокаДЗ);
			
		// Выход
		
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	
	Если ПустаяСтрока(НоваяСтрока.Наименование) Тогда
		НоваяСтрока.Наименование = НоваяСтрока.Имя;
	КонецЕсли; 
	
	//мОбщееКоличествоЗагруженныхПКО = мОбщееКоличествоЗагруженныхПКО + 1;
	//Если мОбщееКоличествоЗагруженныхПКО%10 = 0 Тогда
	//	Состояние("Прочитано ПКО: " + Строка(мОбщееКоличествоЗагруженныхПКО));
	//КонецЕсли;
	
КонецПроцедуры // ЗагрузитьГруппуПВД()

// Осуществляет загрузку правила конвертации объектов
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьПКО(ОбщиеПеременные, ПравилаОбмена, НоваяСтрока)

	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если      ИмяУзла = "Код" Тогда
			Значение = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.Имя = Значение;
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
		ИначеЕсли ИмяУзла = "СпособВыгрузки" Тогда
			НоваяСтрока.СпособВыгрузки = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "НеЗапоминатьВыгруженные" Тогда
			НоваяСтрока.НеЗапоминатьВыгруженные = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "СинхронизироватьПоИдентификатору" Тогда
			НоваяСтрока.СинхронизироватьПоИдентификатору = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли" Тогда
			НоваяСтрока.ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));	
		ИначеЕсли ИмяУзла = "НеВыгружатьОбъектыСвойствПоСсылкам" Тогда
			НоваяСтрока.НеВыгружатьОбъектыСвойствПоСсылкам = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "НеСоздаватьЕслиНеНайден" Тогда
			НоваяСтрока.НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "ИспользоватьБыстрыйПоискПриЗагрузке" Тогда
			НоваяСтрока.ИспользоватьБыстрыйПоискПриЗагрузке = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "ГенерироватьНовыйНомерИлиКодЕслиНеУказан" Тогда
			НоваяСтрока.ГенерироватьНовыйНомерИлиКодЕслиНеУказан = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки" Тогда
			НоваяСтрока.ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD" Тогда
			НоваяСтрока.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике" Тогда
			НоваяСтрока.НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "РегистрироватьОбъектНаУзлеОтправителе" Тогда // не используется
			одПропустить(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "НеЗамещать" Тогда
			НоваяСтрока.НеЗамещать = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			НоваяСтрока.Приемник = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Источник" Тогда
			НоваяСтрока.Источник	= одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));			
		ИначеЕсли ИмяУзла = "ПриоритетОбъектовОбмена" Тогда
			НоваяСтрока.ПриоритетОбъектовОбмена = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		//настройки вариантов поиска		
		ИначеЕсли ИмяУзла = "НастройкаВариантовПоискаОбъектов" Тогда
			НоваяСтрока.НастройкаВариантовПоискаОбъектов = ОбщиеПеременные.мТаблицаНастроекВариантовПоиска.Скопировать();
			ЗагрузитьНастройкиВариантовПоиска(ПравилаОбмена, НоваяСтрока.НастройкаВариантовПоискаОбъектов);			

		// Свойства
		
		ИначеЕсли ИмяУзла = "Свойства" Тогда
			НоваяСтрока.Свойства		= ОбщиеПеременные.мТаблицаПравилКонвертацииСвойств.Скопировать();
			ЗагрузитьСвойства(ОбщиеПеременные, ПравилаОбмена, НоваяСтрока.Свойства);
			
		// Значения
		
		ИначеЕсли ИмяУзла = "Значения" Тогда
            НоваяСтрока.Значения		= ОбщиеПеременные.мТаблицаПравилКонвертацииЗначений.Скопировать();
			ЗагрузитьЗначения(ПравилаОбмена, НоваяСтрока.Значения, НоваяСтрока.Источник);
			
		// Обработчики событий
		
		ИначеЕсли ИмяУзла = "ПередВыгрузкой" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПередВыгрузкой = Не ПустаяСтрока(НоваяСтрока.ПередВыгрузкой);
		ИначеЕсли ИмяУзла = "ПриВыгрузке" Тогда
			НоваяСтрока.ПриВыгрузке = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПриВыгрузке    = Не ПустаяСтрока(НоваяСтрока.ПриВыгрузке);
		ИначеЕсли ИмяУзла = "ПослеВыгрузки" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПослеВыгрузки  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузки);
		ИначеЕсли ИмяУзла = "ПослеВыгрузкиВФайл" Тогда
			НоваяСтрока.ПослеВыгрузкиВФайл = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПослеВыгрузкиВФайл  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузкиВФайл);
		ИначеЕсли ИмяУзла = "ПередЗагрузкой" Тогда
			НоваяСтрока.ПередЗагрузкой               = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПередЗагрузкой = Не ПустаяСтрока(НоваяСтрока.ПередЗагрузкой);
		ИначеЕсли ИмяУзла = "ПриЗагрузке" Тогда
			НоваяСтрока.ПриЗагрузке               = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПриЗагрузке = Не ПустаяСтрока(НоваяСтрока.ПриЗагрузке);
		ИначеЕсли ИмяУзла = "ПослеЗагрузки" Тогда
			НоваяСтрока.ПослеЗагрузки               = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПослеЗагрузки = Не ПустаяСтрока(НоваяСтрока.ПослеЗагрузки);
		ИначеЕсли ИмяУзла = "ПоследовательностьПолейПоиска" Тогда
			НоваяСтрока.ПоследовательностьПолейПоиска               = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПоследовательностейПолейПоиска = Не ПустаяСтрока(НоваяСтрока.ПоследовательностьПолейПоиска);
						
		// Выход
		ИначеЕсли (ИмяУзла = "Правило") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
			
		КонецЕсли;
		
	КонецЦикла;
	
	//мОбщееКоличествоЗагруженныхПКО = мОбщееКоличествоЗагруженныхПКО + 1;
	//Если мОбщееКоличествоЗагруженныхПКО%10 = 0 Тогда
	//	Состояние("Прочитано ПКО: " + Строка(мОбщееКоличествоЗагруженныхПКО));
	//КонецЕсли;

КонецПроцедуры // ЗагрузитьПравилоКонвертации() 

// Осуществляет загрузку группы правил очистки данных в соответствии с форматом правил обмена
//
// Параметры:
//  НоваяСтрока    - строка дерева значений, описывающая группу правил очистки данных
// 
Процедура ЗагрузитьГруппуПОД(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.ЭтоГруппа = Истина;
	НоваяСтрока.Отключить = Число(одАтрибут(ПравилаОбмена, Тип("Булево"), "Отключить"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
			
		ИначеЕсли ИмяУзла = "Правило" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПОД(ПравилаОбмена, СтрокаДЗ);
			
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьГруппуПОД(ПравилаОбмена, СтрокаДЗ);
			
		// Выход
		
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	
	Если ПустаяСтрока(НоваяСтрока.Наименование) Тогда
		НоваяСтрока.Наименование = НоваяСтрока.Имя;
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьГруппуПОД()

// Осуществляет загрузку правила очистки данных в соответствии с форматом правил обмена
//
// Параметры:
//  НоваяСтрока    - строка дерева значений, описывающая правило очистки данных
// 
Процедура ЗагрузитьПОД(ПравилаОбмена, НоваяСтрока)
	
	НоваяСтрока.Отключить = Число(одАтрибут(ПравилаОбмена, Тип("Булево"), "Отключить"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			Значение = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.Имя = Значение;

		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
			
		ИначеЕсли ИмяУзла = "СпособОтбораДанных" Тогда
			НоваяСтрока.СпособОтбораДанных = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "ОбъектВыборки" Тогда
			НоваяСтрока.ОбъектВыборки = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "УдалятьЗаПериод" Тогда
			НоваяСтрока.УдалятьЗаПериод = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "Непосредственно" Тогда
			НоваяСтрока.Непосредственно = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));

		
		// Обработчики событий

		ИначеЕсли ИмяУзла = "ПередОбработкойПравила" Тогда
			НоваяСтрока.ПередОбработкой = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "ПослеОбработкиПравила" Тогда
			НоваяСтрока.ПослеОбработки = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		
		ИначеЕсли ИмяУзла = "ПередУдалениемОбъекта" Тогда
			НоваяСтрока.ПередУдалением = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

			
		// Выход
		
		ИначеЕсли (ИмяУзла = "Правило") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	
	Если ПустаяСтрока(НоваяСтрока.Наименование) Тогда
		НоваяСтрока.Наименование = НоваяСтрока.Имя;
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьПОД()

// Осуществляет загрузку правил конвертации свойств
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ТаблицаСвойств - таблица значений, содержащая ПКС
//  ТаблицаПоиска  - таблица значений, содержащая ПКС (синхронизирующих)
// 
Процедура ЗагрузитьСвойства(ОбщиеПеременные, ПравилаОбмена, ТаблицаСвойств)

	СтрокиДЗ = ТаблицаСвойств.Строки;

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Свойство" Тогда
            СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКС(ПравилаОбмена, ТаблицаСвойств, СтрокаДЗ);
		ИначеЕсли ИмяУзла = "Группа" Тогда
            СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКГС(ОбщиеПеременные, ПравилаОбмена, ТаблицаСвойств, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Свойства") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьСвойства()

Процедура ЗагрузитьНастройкуВариантовПоиска(ПравилаОбмена, НоваяСтрока)
	
	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если ИмяУзла = "ИмяНастройкиДляАлгоритма" Тогда
			НоваяСтрока.ИмяНастройкиДляАлгоритма = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "ИмяНастройкиДляПользователя" Тогда
			НоваяСтрока.ИмяНастройкиДляПользователя = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "ОписаниеНастройкиДляПользователя" Тогда
			НоваяСтрока.ОписаниеНастройкиДляПользователя = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли (ИмяУзла = "ВариантПоиска") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗагрузитьНастройкиВариантовПоиска(ПравилаОбмена, ТаблицаНастроек)

	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если ИмяУзла = "ВариантПоиска" Тогда
			
            СтрокаНастройки = ТаблицаНастроек.Добавить();
			ЗагрузитьНастройкуВариантовПоиска(ПравилаОбмена, СтрокаНастройки);
			
		ИначеЕсли (ИмяУзла = "НастройкаВариантовПоискаОбъектов") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // 

// Осуществляет загрузку правила конвертации группы свойств
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ТаблицаСвойств - таблица значений, содержащая ПКС
// 
Процедура ЗагрузитьПКГС(ОбщиеПеременные, ПравилаОбмена, ТаблицаСвойств, НоваяСтрока)

	НоваяСтрока.ЭтоГруппа     = Истина;
	НоваяСтрока.ПравилаГруппы = ОбщиеПеременные.мТаблицаПравилКонвертацииСвойств.Скопировать();
	НоваяСтрока.Отключить     = одАтрибут(ПравилаОбмена, Тип("Булево"), "Отключить");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Источник" Тогда
			НоваяСтрока.Источник		= одАтрибут(ПравилаОбмена, Тип("Строка"), "Имя");
			НоваяСтрока.ВидИсточника	= одАтрибут(ПравилаОбмена, Тип("Строка"), "Вид");
			НоваяСтрока.ТипИсточника	= одАтрибут(ПравилаОбмена, Тип("Строка"), "Тип");
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			НоваяСтрока.Приемник		= одАтрибут(ПравилаОбмена, Тип("Строка"), "Имя");
			НоваяСтрока.ВидПриемника	= одАтрибут(ПравилаОбмена, Тип("Строка"), "Вид");
			НоваяСтрока.ТипПриемника	= одАтрибут(ПравилаОбмена, Тип("Строка"), "Тип");
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Свойство" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПКС(ПравилаОбмена, НоваяСтрока.ПравилаГруппы, СтрокаДЗ);

		ИначеЕсли ИмяУзла = "ПередОбработкойВыгрузки" Тогда
			НоваяСтрока.ПередОбработкойВыгрузки	= одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПередОбработкойВыгрузки = Не ПустаяСтрока(НоваяСтрока.ПередОбработкойВыгрузки);
			
		ИначеЕсли ИмяУзла = "ПослеОбработкиВыгрузки" Тогда
			НоваяСтрока.ПослеОбработкиВыгрузки	= одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПослеОбработкиВыгрузки = Не ПустаяСтрока(НоваяСтрока.ПослеОбработкиВыгрузки);
			
		ИначеЕсли ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));

		ИначеЕсли ИмяУзла = "НеЗамещать" Тогда
			НоваяСтрока.НеЗамещать = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "КодПравилаКонвертации" Тогда
			НоваяСтрока.ПравилоКонвертации = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "ПередВыгрузкой" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПередВыгрузкой = Не ПустаяСтрока(НоваяСтрока.ПередВыгрузкой);
			
		ИначеЕсли ИмяУзла = "ПриВыгрузке" Тогда
			НоваяСтрока.ПриВыгрузке = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПриВыгрузке    = Не ПустаяСтрока(НоваяСтрока.ПриВыгрузке);
			
		ИначеЕсли ИмяУзла = "ПослеВыгрузки" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
	        НоваяСтрока.ЕстьОбработчикПослеВыгрузки  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузки);
			
		ИначеЕсли ИмяУзла = "ПолучитьИзВходящихДанных" Тогда
			НоваяСтрока.ПолучитьИзВходящихДанных = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "ВыгружатьГруппуЧерезФайл" Тогда
			НоваяСтрока.ВыгружатьГруппуЧерезФайл = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьПКГС() 

// Осуществляет загрузку правила конвертации свойств
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ТаблицаСвойств - таблица значений, содержащая ПКС
//  ТаблицаПоиска  - таблица значений, содержащая ПКС (синхронизирующих)
// 
Процедура ЗагрузитьПКС(ПравилаОбмена, ТаблицаСвойств, НоваяСтрока)

	НоваяСтрока.Поиск     = одАтрибут(ПравилаОбмена, Тип("Булево"), "Поиск");
	НоваяСтрока.Отключить = одАтрибут(ПравилаОбмена, Тип("Булево"), "Отключить");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если ИмяУзла = "Источник" Тогда
			НоваяСтрока.Источник		= одАтрибут(ПравилаОбмена, Тип("Строка"), "Имя");
			НоваяСтрока.ВидИсточника	= одАтрибут(ПравилаОбмена, Тип("Строка"), "Вид");
			НоваяСтрока.ТипИсточника	= одАтрибут(ПравилаОбмена, Тип("Строка"), "Тип");
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			НоваяСтрока.Приемник		= одАтрибут(ПравилаОбмена, Тип("Строка"), "Имя");
			НоваяСтрока.ВидПриемника	= одАтрибут(ПравилаОбмена, Тип("Строка"), "Вид");
			НоваяСтрока.ТипПриемника	= одАтрибут(ПравилаОбмена, Тип("Строка"), "Тип");
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));

		ИначеЕсли ИмяУзла = "НеЗамещать" Тогда
			НоваяСтрока.НеЗамещать = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "КодПравилаКонвертации" Тогда
			НоваяСтрока.ПравилоКонвертации = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "ПередВыгрузкой" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПередВыгрузкой = Не ПустаяСтрока(НоваяСтрока.ПередВыгрузкой);
			
		ИначеЕсли ИмяУзла = "ПриВыгрузке" Тогда
			НоваяСтрока.ПриВыгрузке = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			НоваяСтрока.ЕстьОбработчикПриВыгрузке    = Не ПустаяСтрока(НоваяСтрока.ПриВыгрузке);
			
		ИначеЕсли ИмяУзла = "ПослеВыгрузки" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
	        НоваяСтрока.ЕстьОбработчикПослеВыгрузки  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузки);
			
		ИначеЕсли ИмяУзла = "ПолучитьИзВходящихДанных" Тогда
			НоваяСтрока.ПолучитьИзВходящихДанных = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "ПриводитьКДлине" Тогда
			
			ДлинаЭлемента = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
			НоваяСтрока.ПриводитьКДлине = Истина;
			
		ИначеЕсли ИмяУзла = "ИмяПараметраДляПередачи" Тогда
			
			НоваяСтрока.ИмяПараметраДляПередачи = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "ПоискПоДатеНаРавенство" Тогда
			
			НоваяСтрока.ПоискПоДатеНаРавенство = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли (ИмяУзла = "Свойство") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьПКС() 

// Осуществляет загрузку правил конвертации значений
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  Значения       - соответствие значений объекта источника - строковым
//                   представлениям объекта приемника
//  ТипИсточника   - значение типа Тип - тип объекта источника
// 
Процедура ЗагрузитьЗначения(ПравилаОбмена, ТаблицаЗначений, ТипИсточника);

	СтрокиДЗ = ТаблицаЗначений.Строки;

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Значение" Тогда
            СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКЗ(ПравилаОбмена, ТаблицаЗначений, СтрокаДЗ);
		ИначеЕсли ИмяУзла = "Группа" Тогда
            СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКГЗ(ПравилаОбмена, ТаблицаЗначений, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Значения") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Осуществляет загрузку правила конвертации значений
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  Значения       - соответствие значений объекта источника - строковым
//                   представлениям объекта приемника
//  ТипИсточника   - значение типа Тип - тип объекта источника
// 
Процедура ЗагрузитьПКГЗ(ПравилаОбмена, ТаблицаЗначений, НоваяСтрока)

	НоваяСтрока.ЭтоГруппа = Истина;

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			НоваяСтрока.Комментарий = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Описание" Тогда
			НоваяСтрока.Описание = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
		ИначеЕсли ИмяУзла = "Значение" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПКЗ(ПравилаОбмена, ТаблицаЗначений, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьПКЗ() 

// Осуществляет загрузку правила конвертации значений
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  Значения       - соответствие значений объекта источника - строковым
//                   представлениям объекта приемника
//  ТипИсточника   - значение типа Тип - тип объекта источника
// 
Процедура ЗагрузитьПКЗ(ПравилаОбмена, ТаблицаЗначений, НоваяСтрока)

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Источник" Тогда
			НоваяСтрока.Источник = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			НоваяСтрока.Приемник = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			НоваяСтрока.Комментарий = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Описание" Тогда
			НоваяСтрока.Описание = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
		ИначеЕсли (ИмяУзла = "Значение") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьПКЗ() 

// Осуществляет загрузку группы правил выгрузки данных в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  НоваяСтрока    - строка дерева значений, описывающая группу правил выгрузки данных
// 
Процедура ЗагрузитьПВГД(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.ЭтоГруппа = Истина;
	НоваяСтрока.Отключить = одАтрибут(ПравилаОбмена, Тип("Булево"), "Отключить");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если ИмяУзла = "Код" Тогда
			
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "Наименование" Тогда
			
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "Порядок" Тогда
			
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));

		ИначеЕсли ИмяУзла = "Описание" Тогда
			
			НоваяСтрока.Описание = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			
			НоваяСтрока.Комментарий = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли (ИмяУзла = "Правило") Тогда
			
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПВД(ПравилаОбмена, СтрокаДЗ);
			
		ИначеЕсли ИмяУзла = "Группа" И ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
            ЗагрузитьПВГД(ПравилаОбмена, СтрокаДЗ);
			
		ИначеЕсли ИмяУзла = "Группа" И ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПустаяСтрока(НоваяСтрока.Наименование) Тогда
		
		НоваяСтрока.Наименование = НоваяСтрока.Имя;
		
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьПВГД()

// Осуществляет загрузку правила выгрузки данных в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  НоваяСтрока    - строка дерева значений, описывающая правило выгрузки данных
// 
Процедура ЗагрузитьПВД(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.Отключить = одАтрибут(ПравилаОбмена, Тип("Булево"), "Отключить");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));

		ИначеЕсли ИмяУзла = "Описание" Тогда
			НоваяСтрока.Описание = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			НоваяСтрока.Комментарий = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "СпособОтбораДанных" Тогда
			НоваяСтрока.СпособОтбораДанных = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "ВыбиратьДанныеДляВыгрузкиОднимЗапросом" Тогда
			НоваяСтрока.ВыбиратьДанныеДляВыгрузкиОднимЗапросом = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));			
			
		ИначеЕсли ИмяУзла = "НеВыгружатьОбъектыСозданныеВБазеПриемнике" Тогда
			НоваяСтрока.НеВыгружатьОбъектыСозданныеВБазеПриемнике = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "ОбъектВыборки" Тогда
			НоваяСтрока.ОбъектВыборки = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "КодПравилаКонвертации" Тогда
			НоваяСтрока.ПравилоКонвертации = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		
		// Обработчики событий

		ИначеЕсли ИмяУзла = "ПередОбработкойПравила" Тогда
			НоваяСтрока.ПередОбработкой = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
			
		ИначеЕсли ИмяУзла = "ПослеОбработкиПравила" Тогда
			НоваяСтрока.ПослеОбработки = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		
		ИначеЕсли ИмяУзла = "ПередВыгрузкойОбъекта" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

		ИначеЕсли ИмяУзла = "ПослеВыгрузкиОбъекта" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));

			
		// Выход
		
		ИначеЕсли (ИмяУзла = "Правило") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	
	Если ПустаяСтрока(НоваяСтрока.Наименование) Тогда
		НоваяСтрока.Наименование = НоваяСтрока.Имя;
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьПВД()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАГРУЗКИ АЛГОРИТМОВ И ЗАПРОСОВ

// Осуществляет загрузку алгоритмов в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьАлгоритмы(ОбщиеПеременные, ПравилаОбмена)

	ОбщиеПеременные.ТабАлгоритмы.Строки.Очистить();
	СтрокиДЗ = ОбщиеПеременные.ТабАлгоритмы.Строки;

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Алгоритм" Тогда
            СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьАлгоритм(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли ИмяУзла = "Группа" Тогда
			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьАлгоритмГруппа(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Алгоритмы") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьАлгоритмы() 

// Осуществляет загрузку групп алгоритмов в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьАлгоритмГруппа(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.ЭтоГруппа = Истина;

	НоваяСтрока.Код = одАтрибут(ПравилаОбмена, Тип("Строка"), "Имя");

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если       ИмяУзла = "Комментарий" Тогда
			НоваяСтрока.Комментарий = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Алгоритм" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьАлгоритм(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьАлгоритмГруппа(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьАлгоритмГруппа()

// Осуществляет загрузку алгоритма в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьАлгоритм(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.Код = одАтрибут(ПравилаОбмена, Тип("Строка"), "Имя");
	НоваяСтрока.ИспользуетсяПриЗагрузке = одАтрибут(ПравилаОбмена, Тип("Булево"), "ИспользуетсяПриЗагрузке");

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Текст" Тогда
			НоваяСтрока.Алгоритм = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			НоваяСтрока.Комментарий = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли ИмяУзла = "Параметры" Тогда
			НоваяСтрока.Параметры = одЗначениеЭлемента(ПравилаОбмена, Тип("Строка"));
		ИначеЕсли (ИмяУзла = "Алгоритм") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьАлгоритм() 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ОБЪЕКТОМ XMLЧтение

// Читает значение атрибута по имени из указанного объекта, приводит значение
// к указанному примитивному типу
//
// Параметры:
//  Объект      - объект типа XMLЧтение, спозиционированный на начале элемента,
//                атрибут которого требуется получить
//  Тип         - Значение типа Тип. Тип атрибута
//  Имя         - Строка. Имя атрибута
//
// Возвращаемое значение:
//  Значение атрибута полученное по имени и приведенное к указанному типу
// 
Функция одАтрибут(Объект, Тип, Имя)

	СтрЗначение = СокрП(Объект.ПолучитьАтрибут(Имя));
	Если Не ПустаяСтрока(СтрЗначение) Тогда
		Возврат XMLЗначение(Тип, СтрЗначение);
	Иначе
		Если      Тип = Тип("Строка") Тогда
			Возврат ""; 
		ИначеЕсли Тип = Тип("Булево") Тогда
			Возврат Ложь;
		ИначеЕсли Тип = Тип("Число") Тогда
			Возврат 0;
		ИначеЕсли Тип = Тип("Дата") Тогда
			Возврат Дата("01.01.0001 00:00:00");
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции // одАтрибут() 

// Возвращает объект ОписаниеТипов, содержащий указанный тип
//
// Параметры:
//  ЗначениеТипа   - Строка с именем типа или значение типа Тип
//  
// Возвращаемое значение:
//  ОписаниеТипов
//  
Функция одОписаниеТипа(ЗначениеТипа)

	МассивТипов = Новый Массив;
	Если ТипЗнч(ЗначениеТипа) = Тип("Строка") Тогда
		МассивТипов.Добавить(Тип(ЗначениеТипа));
	Иначе
		МассивТипов.Добавить(ЗначениеТипа);
	КонецЕсли; 
	ОписаниеТипов	= Новый ОписаниеТипов(МассивТипов);

	Возврат ОписаниеТипов;

КонецФункции // одОписаниеТипа()

// Читает текст элемента и приводит значение к указанному типу
//
// Параметры:
//  Объект           - объект типа XMLЧтение, из которого осуществлется чтение
//  Тип              - тип получаемого значения
//  ИскатьПоСвойству - для ссылочных типов может быть указано свойство, по которому
//                     следует искать объект: "Код", "Наименование", <ИмяРеквизита>, "Имя" (предопределенного значения)
//
// Возвращаемое значение:
//  Значение xml-элемента, приведенное к соответствующему типу
//
Функция одЗначениеЭлемента(Объект, Знач Тип = Неопределено, ИскатьПоСвойству="")
	Если Тип = Неопределено Тогда
		Тип = Тип("Строка");
	КонецЕсли;

	Значение = "";
	Имя      = Объект.ЛокальноеИмя;

	Пока Объект.Прочитать() Цикл
		ИмяУзла = Объект.ЛокальноеИмя;
		ТипУзла = Объект.ТипУзла;
		Если ТипУзла = ТипУзлаXML.Текст Тогда
			Значение = СокрП(Объект.Значение);
		ИначеЕсли (ИмяУзла = Имя) И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат XMLЗначение(Тип, Значение);	
	
КонецФункции // одЗначениеЭлемента() 

// Пропускает узлы xml до конца указанного элемента (по умолчанию текущего)
//
// Параметры:
//  Объект   - объект типа XMLЧтение
//  Имя      - имя узла, до конца которого пропускаем элементы
// 
Процедура одПропустить(Объект, Имя="")

	КолвоВложений = 0; // количество одноименных вложений

	Если Имя = "" Тогда
		Имя = Объект.ЛокальноеИмя;	
	КонецЕсли; 
	
	Пока Объект.Прочитать() Цикл
		ИмяУзла = Объект.ЛокальноеИмя;
		ТипУзла = Объект.ТипУзла;
		Если ИмяУзла = Имя Тогда
			Если ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				Если КолвоВложений = 0 Тогда
					Прервать;
				Иначе
					КолвоВложений = КолвоВложений - 1;
				КонецЕсли; 
			ИначеЕсли ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				КолвоВложений = КолвоВложений + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // одПропустить() 

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ОпределитьФайлСжат(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	АрхивироватьФайл = (ВРЕГ(Файл.Расширение) = ВРЕГ(".zip"));
	
	Возврат АрхивироватьФайл;
	
КонецФункции

// Составляет полное имя файла из имени каталога и имени файла.
//
// Параметры
//  ИмяКаталога  – Строка, содержащая путь к каталогу файла на диске.
//  ИмяФайла     – Строка, содержащая имя файла, без имени каталога.
//
// Возвращаемое значение:
//   Строка – полное имя файла с учетом каталога.
//
Функция ПолучитьПолноеИмяФайла(ИмяКаталога, ИмяФайла) Экспорт

	Если Не ПустаяСтрока(ИмяФайла) Тогда
		
		Возврат ИмяКаталога + ?(Прав(ИмяКаталога, 1) = "\", "", "\") + ИмяФайла;	
		
	Иначе
		
		Возврат ИмяКаталога;
		
	КонецЕсли;

КонецФункции

Функция РаспаковатьФайлДанных(ИсходноеИмяФайла)
	
	Попытка
		
		КаталогДляРаспаковки = КаталогВременныхФайлов();
		
		ИмяФайлаЗагрузкиДанных = СтрЗаменить(ИсходноеИмяФайла, ".zip", ".xml");
		
		//Состояние("Выполняется распаковка файла ...");
				
		Архиватор = Новый ЧтениеZipФайла(ИсходноеИмяФайла);
		
		Если Архиватор.Элементы.Количество() > 0 Тогда
			
			Архиватор.Извлечь(Архиватор.Элементы[0], КаталогДляРаспаковки, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			ИмяФайлаЗагрузкиДанных = ПолучитьПолноеИмяФайла(КаталогДляРаспаковки, Архиватор.Элементы[0].Имя);
			
		Иначе
			
			ИмяФайлаЗагрузкиДанных = "";	
			
		КонецЕсли;

		Архиватор.Закрыть();
	
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при распаковке файла правил: " + ОписаниеОшибки());
		ИмяФайлаЗагрузкиДанных = "";
							
	КонецПопытки;
	
	Возврат ИмяФайлаЗагрузкиДанных;	
	
КонецФункции

// Читает реквизиты конвертации из XML-файла.
// Используется для идентификации конвертации, источника и приемника.
//
// Параметры:
//  ИмяФайла       - имя XML-файла
//
// Возвращаемое значение:
//  Соответствие, содержащее реквизиты конвертации
//
Функция ПолучитьРеквизитыКонвертации(ИмяФайла) Экспорт

	Результат = Новый Соответствие;

	Если ПустаяСтрока(ИмяФайла) Тогда
    	Возврат Результат;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден файл с именем: " + ИмяФайла);
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ Файл.ЭтоФайл() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл с именем: " + ИмяФайла + " является каталогом.");
		Возврат Результат;
	КонецЕсли;
	
	ФайлЗапакован = ОпределитьФайлСжат(ИмяФайла);
	
	Если ФайлЗапакован Тогда		
		ИмяФайлаДляЧтенияДанных = РаспаковатьФайлДанных(ИмяФайла);		
		Если ПустаяСтрока(ИмяФайлаДляЧтенияДанных) Тогда 
			Возврат Результат;
		КонецЕсли;
	Иначе
		ИмяФайлаДляЧтенияДанных = ИмяФайла;
	КонецЕсли;
	
	ПравилаОбмена = Новый ЧтениеXML();
	ПравилаОбмена.ОткрытьФайл(ИмяФайлаДляЧтенияДанных);
	ПравилаОбмена.Прочитать();
	
	Стек = Новый Массив;
	
	Если Не ((ПравилаОбмена.ЛокальноеИмя = "ПравилаОбмена") И (ПравилаОбмена.ТипУзла = ТипУзлаXML.НачалоЭлемента)) Тогда
		Возврат Результат;
	Иначе
		Стек.Добавить(ПравилаОбмена.ЛокальноеИмя);
	КонецЕсли;
	
	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если      ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Стек.Добавить(ИмяУзла);
			Если      (ИмяУзла = "Наименование") И (Стек[Стек.Количество() - 2] = "ПравилаОбмена") Тогда
				Результат.Вставить("Наименование", одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
				Стек.Удалить(Стек.Количество() - 1);
			ИначеЕсли (ИмяУзла = "Источник") И (Стек[Стек.Количество() - 2] = "ПравилаОбмена") Тогда
				Результат.Вставить("Источник", одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
				Стек.Удалить(Стек.Количество() - 1);
			ИначеЕсли (ИмяУзла = "Приемник") И (Стек[Стек.Количество() - 2] = "ПравилаОбмена") Тогда
				Результат.Вставить("Приемник", одЗначениеЭлемента(ПравилаОбмена, Тип("Строка")));
				Стек.Удалить(Стек.Количество() - 1);



			КонецЕсли;
		ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Стек.Удалить(Стек.Количество() - 1);
		КонецЕсли;

		Если Результат.Количество() = 3 Тогда
        	Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ПравилаОбмена.Закрыть();
	
	Если ФайлЗапакован Тогда
		
		УдалитьФайлы(ИмяФайлаДляЧтенияДанных);
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции // ПолучитьРеквизитыКонвертации()

////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ ТАБЛИЦ ПРАВИЛ ОБМЕНА

Процедура ИнициализацияТаблицуНастроекВариантовПоиска(Таб)
	
	Колонки = Таб.Колонки;

	Колонки.Добавить("ИмяНастройкиДляАлгоритма");
	Колонки.Добавить("ИмяНастройкиДляПользователя");
	Колонки.Добавить("ОписаниеНастройкиДляПользователя");	
	
КонецПроцедуры

// Инициализирует колонки таблицы правил конвертации объектов
//
// Параметры:
//  Нет.
// 
Процедура ИнициализацияТаблицыПКО(ОбщиеПеременные)

	ОбщиеПеременные.Вставить("ТабПКО", Новый ДеревоЗначений);
	
	Колонки = ОбщиеПеременные.ТабПКО.Колонки;

	Колонки.Добавить("ЭтоГруппа",		одОписаниеТипа("Булево"));

	Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Порядок");

	Колонки.Добавить("СпособВыгрузки");

	Колонки.Добавить("Источник");
	Колонки.Добавить("Приемник");

	Колонки.Добавить("ПередВыгрузкой");
	Колонки.Добавить("ПриВыгрузке");
	Колонки.Добавить("ПослеВыгрузки");
	Колонки.Добавить("ПослеВыгрузкиВФайл");

	Колонки.Добавить("ЕстьОбработчикПередВыгрузкой",	одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПриВыгрузке",		одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеВыгрузки",		одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеВыгрузкиВФайл",одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ПередЗагрузкой");
	Колонки.Добавить("ПриЗагрузке");
	Колонки.Добавить("ПослеЗагрузки");
	
	Колонки.Добавить("ЕстьОбработчикПередЗагрузкой", одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПриЗагрузке",    одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеЗагрузки",  одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПоследовательностейПолейПоиска",  одОписаниеТипа("Булево"));
		
	Колонки.Добавить("Свойства", одОписаниеТипа("ДеревоЗначений"));
	
	Колонки.Добавить("Значения", одОписаниеТипа("ДеревоЗначений"));
	
	Колонки.Добавить("НастройкаВариантовПоискаОбъектов", одОписаниеТипа("ТаблицаЗначений"));
	
	Колонки.Добавить("ВыгружатьПредставлениеИсточника",		одОписаниеТипа("Булево"));
	
	Колонки.Добавить("НеЗамещать",					      одОписаниеТипа("Булево"));
	Колонки.Добавить("НеЗапоминатьВыгруженные",           одОписаниеТипа("Булево"));
    Колонки.Добавить("СинхронизироватьПоИдентификатору", одОписаниеТипа("Булево"));
	Колонки.Добавить("ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли", одОписаниеТипа("Булево"));
    Колонки.Добавить("НеВыгружатьОбъектыСвойствПоСсылкам", одОписаниеТипа("Булево"));
	Колонки.Добавить("НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска", одОписаниеТипа("Булево"));	
	Колонки.Добавить("ИспользоватьБыстрыйПоискПриЗагрузке", одОписаниеТипа("Булево"));
	Колонки.Добавить("ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки", одОписаниеТипа("Булево"));
	Колонки.Добавить("ГенерироватьНовыйНомерИлиКодЕслиНеУказан", одОписаниеТипа("Булево"));
	Колонки.Добавить("ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD", одОписаниеТипа("Булево"));
	Колонки.Добавить("НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике", одОписаниеТипа("Булево"));
		
	Колонки.Добавить("ПоследовательностьПолейПоиска");
	Колонки.Добавить("ПриоритетОбъектовОбмена");
			
	Колонки.Добавить("ВсеОбъектыВыгружены",         одОписаниеТипа("Булево"));
	
КонецПроцедуры // ИнициализацияТаблицыПравилКонвертации()

// Инициализирует колонки таблицы правил конвертации свойств объектов
//
// Параметры:
//  Таб            - ТаблицаЗначений. инициализируемая таблица правил конвертации свойств
// 
Процедура ИнициализацияТаблицыПКС(Таб) Экспорт

	Колонки = Таб.Колонки;

	Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Порядок");

	Колонки.Добавить("ЭтоГруппа", 			одОписаниеТипа("Булево"));
    Колонки.Добавить("ПравилаГруппы");

	Колонки.Добавить("ВидИсточника");
	Колонки.Добавить("ВидПриемника");

	Колонки.Добавить("ТипИсточника");
	Колонки.Добавить("ТипПриемника");
	
	Колонки.Добавить("СтрокаТипИсточника");
	Колонки.Добавить("СтрокаТипПриемника");
	
	Колонки.Добавить("Источник");
	Колонки.Добавить("Приемник");
	
	Колонки.Добавить("СтрокаИсточник");
	Колонки.Добавить("СтрокаПриемник");

	Колонки.Добавить("ПравилоКонвертации");

	Колонки.Добавить("ПолучитьИзВходящихДанных", одОписаниеТипа("Булево"));
	Колонки.Добавить("ВыгружатьГруппуЧерезФайл", одОписаниеТипа("Булево"));
	
	Колонки.Добавить("НеЗамещать", одОписаниеТипа("Булево"));
	Колонки.Добавить("Поиск", 	   одОписаниеТипа("Булево"));
	Колонки.Добавить("Отключить",  одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ПередВыгрузкой");
	Колонки.Добавить("ПриВыгрузке");
	Колонки.Добавить("ПослеВыгрузки");

	Колонки.Добавить("ПередОбработкойВыгрузки");
	Колонки.Добавить("ПослеОбработкиВыгрузки");

	Колонки.Добавить("ЕстьОбработчикПередВыгрузкой",			одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПриВыгрузке",				одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеВыгрузки",				одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ЕстьОбработчикПередОбработкойВыгрузки",	одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеОбработкиВыгрузки",	одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ПриводитьКДлине",	одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ИмяПараметраДляПередачи");
	Колонки.Добавить("ПоискПоДатеНаРавенство",	одОписаниеТипа("Булево"));
			
КонецПроцедуры // ИнициализацияТаблицыПравилКонвертацииСвойств()

// Инициализирует колонки таблицы правил конвертации значений объектов
//
// Параметры:
//  Таб            - ТаблицаЗначений. инициализируемая таблица правил конвертации значений
// 
Процедура ИнициализацияТаблицыПКЗ(Таб) Экспорт

	Колонки = Таб.Колонки;

	Колонки.Добавить("ЭтоГруппа", одОписаниеТипа("Булево"));
    Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Источник");
	Колонки.Добавить("Приемник");
	Колонки.Добавить("Комментарий");
	Колонки.Добавить("Описание");
	Колонки.Добавить("Порядок");

КонецПроцедуры // ИнициализацияТаблицыПравилКонвертацииСвойств()

////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ ТАБЛИЦ АЛГОРИТМОВ И ЗАПРОСОВ

// Инициализирует колонки таблицы алгоритмов
//
// Параметры:
//  Нет.
// 
Процедура ИнициализацияТаблицыАлгоритмов(ОбщиеПеременные)

	ОбщиеПеременные.Вставить("ТабАлгоритмы", Новый ДеревоЗначений);
	
	Колонки = ОбщиеПеременные.ТабАлгоритмы.Колонки;

	Колонки.Добавить("Код");
	Колонки.Добавить("Алгоритм");
	Колонки.Добавить("Параметры");
	Колонки.Добавить("Комментарий");
	Колонки.Добавить("ЭтоГруппа",		одОписаниеТипа("Булево"));
	Колонки.Добавить("ИспользуетсяПриЗагрузке",	одОписаниеТипа("Булево"));
	
КонецПроцедуры // ИнициализацияТаблицыПравилКонвертации()

////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ ОБЪЕКТОВ, СВОЙСТВ И ЗНАЧЕНИЙ

// Осуществляет групповую инициализацию строк таблицы ПКО.
// Строковым идентификаторам источника и приемника ставится в соответствие ссылка на элемент справочника.
//
// Параметры:
//  КонфигурацияИсточник - ссылка на конфигурацию источник
//  КонфигурацияПриемник - ссылка на конфигурацию приемник
// 
Процедура ИнициализацияОбъектов(ОбщиеПеременные, КонфигурацияИсточник) Экспорт

	ИнициализацияПКО(ОбщиеПеременные.ТабПКО, КонфигурацияИсточник);

КонецПроцедуры // ИнициализацияОбъектов()

// Осуществляет инициализацию строк таблицы ПКО.
// Строковым идентификаторам источника и приемника ставится в соответствие ссылка на элемент справочника.
//
// Параметры:
//  СтрокиПКО            - коллекция строк ПКО
//  КонфигурацияИсточник - ссылка на конфигурацию источник
//  КонфигурацияПриемник - ссылка на конфигурацию приемник
// 
Процедура ИнициализацияПКО(СтрокиПКО, КонфигурацияИсточник)

	Для каждого Строка из СтрокиПКО.Строки Цикл
		
		Строка.Источник = ПолучитьОбъект(Строка.Источник, Справочники.Объекты, КонфигурацияИсточник);
		
		//??
		Строка.Приемник = ПолучитьОбъект(Строка.Приемник, Справочники.Объекты, Неопределено);

		ИнициализацияСвойств(Строка.Свойства, КонфигурацияИсточник, Строка.Источник, Строка.Приемник);
		ИнициализацияЗначений(Строка.Значения, КонфигурацияИсточник, Строка.Источник, Строка.Приемник);

		ИнициализацияПКО(Строка, КонфигурацияИсточник);
		
		//мОбщееКоличествоСопоставленныхСтрокПКО = мОбщееКоличествоСопоставленныхСтрокПКО + 1;
		//Если мОбщееКоличествоСопоставленныхСтрокПКО%5 = 0 Тогда
		//	Состояние("Сопоставлено объектам конфигурации: " + Строка(мОбщееКоличествоСопоставленныхСтрокПКО) + " из " + Строка(мОбщееКоличествоЗагруженныхПКО));
		//КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ИнициализацияПКО()

// Осуществляет инициализацию строк таблицы ПКС.
// Строковым идентификаторам источника и приемника ставится в соответствие ссылка на элемент справочника.
//
// Параметры:
//  СтрокаСвойство       - коллекция строк ПКС
//  КонфигурацияИсточник - ссылка на конфигурацию источник
//  КонфигурацияПриемник - ссылка на конфигурацию приемник
//  ОбъектИсточник       - ссылка на объект источник
//  ОбъектПриемник       - ссылка на объект приемник
// 
Процедура ИнициализацияСвойств(СтрокаСвойство, КонфигурацияИсточник, ОбъектИсточник, ОбъектПриемник)

	Для каждого Строка из СтрокаСвойство.Строки Цикл

		Строка.СтрокаТипИсточника = Строка.ТипИсточника;
		Строка.СтрокаТипПриемника = Строка.ТипПриемника;
		
		Строка.СтрокаИсточник = Строка.Источник;
		Строка.СтрокаПриемник = Строка.Приемник;
		
		Строка.ТипИсточника = ПолучитьОбъект(Строка.ТипИсточника, Справочники.Объекты, КонфигурацияИсточник);
		
		//??
	    Строка.ТипПриемника = ПолучитьОбъект(Строка.ТипПриемника, Справочники.Объекты, Неопределено);

		Строка.Источник = ПолучитьОбъект(Строка.Источник, Справочники.Свойства, ОбъектИсточник, Строка.ТипИсточника, Строка.ВидИсточника, Строка.ЭтоГруппа, ?(Строка.Родитель = Неопределено, Справочники.Свойства.ПустаяСсылка(), Строка.Родитель.Источник));
		
		//??
		Строка.Приемник = ПолучитьОбъект(Строка.Приемник, Справочники.Свойства, ОбъектПриемник, Строка.ТипПриемника, Строка.ВидПриемника, Строка.ЭтоГруппа, ?(Строка.Родитель = Неопределено, Справочники.Свойства.ПустаяСсылка(), Строка.Родитель.Приемник));
		
		ИнициализацияСвойств(Строка, КонфигурацияИсточник, ОбъектИсточник, ОбъектПриемник);
		
	КонецЦикла;
	
КонецПроцедуры // ИнициализацияСвойств()

// Осуществляет инициализацию строк таблицы ПКЗ.
// Строковым идентификаторам источника и приемника ставится в соответствие ссылка на элемент справочника.
//
// Параметры:
//  СтрокаЗначение       - коллекция строк ПКЗ
//  КонфигурацияИсточник - ссылка на конфигурацию источник
//  КонфигурацияПриемник - ссылка на конфигурацию приемник
//  ОбъектИсточник       - ссылка на объект источник
//  ОбъектПриемник       - ссылка на объект приемник
// 
Процедура ИнициализацияЗначений(СтрокаЗначение, КонфигурацияИсточник, ОбъектИсточник, ОбъектПриемник)

	Для каждого Строка из СтрокаЗначение.Строки Цикл

		Строка.Источник = ПолучитьОбъект(Строка.Источник, Справочники.Значения, ОбъектИсточник);
		
		Строка.Приемник = ПолучитьОбъект(Строка.Приемник, Справочники.Значения, ОбъектПриемник);

		ИнициализацияЗначений(Строка, КонфигурацияИсточник, ОбъектИсточник, ОбъектПриемник);
		
	КонецЦикла;
	
КонецПроцедуры // ИнициализацияЗначений()

Функция НайтиОбъектРодительПоИмени(НаименованиеОбъекта, Владелец)
	
	Родитель = СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, НаименованиеОбъекта);
		
	Возврат Родитель;
	
КонецФункции

// Осуществляет поиск объекта в соответствующем справочнике по имени.
// Если не находит, тогда создает новый в соответствии с переданными параметрами.
//
// Параметры:
//  Имя             - строковое наименование объекта
//  Справочник      - значение типа "СправочникМенеджер" инициализируемого объекта
//  Владелец        - ссылка на владельца инициализируемого объекта
//  Тип             - ссылка на объект, соответствующий типу инициализируемого объекта
//  Вид             - значение Перечисления "ВидыСвойств"
//  ЭтоГруппа       - булево, объект является группой
//  Родитель        - родитель
//  ИскатьВИерархии - булево, если родитель не указан, то по этому флагу можно искать объекты только верхнего уровня
//  
// Возвращаемое значение:
//  Ссылка на полученный объект
// 
Функция ПолучитьОбъект(Имя, Справочник, Владелец, Тип = 0, Вид = 0, ЭтоГруппа = 0, Родитель = Неопределено)
	
	Если Владелец = Неопределено Тогда
		
		//?? доробити
		Возврат Имя;
	
	КонецЕсли;
	
	Если ТипЗнч(Владелец) = Тип("Строка") Тогда
		
		//?? доробити
		Возврат Имя;
	
	КонецЕсли;
	
	Если ПустаяСтрока(Имя) Тогда
		
		Возврат Справочник.ПустаяСсылка();
		
	КонецЕсли;
	
	ИмяОбъекта = Имя;
	
	Если Справочник = Справочники.Свойства Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ Первые 1
		               |	Свойства.Ссылка
		               |ИЗ
		               |	Справочник.Свойства КАК Свойства
		               |ГДЕ
		               |	Свойства.Наименование = &Наименование
		               |	И Свойства.Владелец = &Владелец
		               |	И Свойства.ЭтоГруппа = &ЭтоГруппа
					   |	И Свойства.Родитель = &Родитель";
					   
		Если ЗначениеЗаполнено(Вид) Тогда
			Запрос.Текст = Запрос.Текст + Символы.ПС +  "И Свойства.Вид = &Вид";
		КонецЕсли;
					   
		Запрос.УстановитьПараметр("Наименование", Имя);
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("Родитель", Родитель);
		
		Если ЗначениеЗаполнено(Вид) Тогда
			Запрос.УстановитьПараметр("Вид", Перечисления.ВидыСвойств[Вид]);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ЭтоГруппа", ЭтоГруппа);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ссылка = NULL Тогда
				НайденныйОбъект = Справочники.Свойства.ПустаяСсылка();
			Иначе
				НайденныйОбъект = Выборка.ссылка;
			КонецЕсли;
		Иначе
			НайденныйОбъект = Справочники.Свойства.ПустаяСсылка();
		КонецЕсли;
		
	Иначе
	
		НайденныйОбъект = Справочник.НайтиПоНаименованию(Имя, Истина, Родитель, Владелец);
		
	КонецЕсли;

	Если НЕ НайденныйОбъект.Пустая() Тогда
		Возврат НайденныйОбъект;
	КонецЕсли;
		
	Если ЭтоГруппа Тогда
		
		НовыйОбъект = Справочник.СоздатьГруппу();
		
	Иначе
		
		НовыйОбъект = Справочник.СоздатьЭлемент();
		
	КонецЕсли;

	НовыйОбъект.Владелец = Владелец;
	
	Если Тип(Справочник) = Тип("СправочникМенеджер.Объекты") Тогда
		
		НовыйОбъект.Имя = Имя;
		
		Если      Имя = "Строка" Тогда
			
			НовыйОбъект.Имя      = ИмяОбъекта;
			НовыйОбъект.Синоним  = ИмяОбъекта;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.Строка;
			
		ИначеЕсли Имя = "Число" Тогда
			
			НовыйОбъект.Имя      = ИмяОбъекта;
			НовыйОбъект.Синоним  = ИмяОбъекта;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.Число;
			
		ИначеЕсли Имя = "Булево" Тогда
			
			НовыйОбъект.Имя      = ИмяОбъекта;
			НовыйОбъект.Синоним  = ИмяОбъекта;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.Булево;
			
		ИначеЕсли Имя = "Дата" Тогда
			
			НовыйОбъект.Имя      = ИмяОбъекта;
			НовыйОбъект.Синоним  = ИмяОбъекта;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.Дата;
			
		ИначеЕсли Имя = "ХранилищеЗначения" Тогда
			
			НовыйОбъект.Имя      = ИмяОбъекта;
			НовыйОбъект.Синоним  = ИмяОбъекта;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.ХранилищеЗначения;
			
		ИначеЕсли Имя = "УникальныйИдентификатор" Тогда
			
			НовыйОбъект.Имя      = ИмяОбъекта;
			НовыйОбъект.Синоним  = ИмяОбъекта;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.УникальныйИдентификатор;
			
		ИначеЕсли Найти(Имя, "СправочникСсылка") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.Справочник;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("Справочники", Владелец);
			
		ИначеЕсли Найти(Имя, "ДокументСсылка") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.Документ;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("Документы", Владелец);
			
		ИначеЕсли Найти(Имя, "ПеречислениеСсылка") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.Перечисление;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("Перечисления", Владелец);
			
		ИначеЕсли Найти(Имя, "ПланВидовХарактеристикСсылка") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.ПланВидовХарактеристик;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("ПланыВидовХарактеристик", Владелец);
			
		ИначеЕсли Найти(Имя, "ПланВидовРасчетаСсылка") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.ПланВидовРасчета;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("ПланыВидовРасчета", Владелец);
			
		ИначеЕсли Найти(Имя, "ПланСчетов") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.ПланСчетов;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("ПланыСчетов", Владелец);
			
		ИначеЕсли Найти(Имя, "РегистрСведенийЗапись") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.РегистрСведений;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("РегистрыСведений", Владелец);
			
		ИначеЕсли Найти(Имя, "РегистрНакопленияЗапись") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.РегистрНакопления;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("РегистрыНакопления", Владелец);
			
		ИначеЕсли Найти(Имя, "РегистрБухгалтерииЗапись") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.РегистрБухгалтерии;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("РегистрыБухгалтерии", Владелец);
			
		ИначеЕсли Найти(Имя, "РегистрРасчетаЗапись") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.РегистрРасчета;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("РегистрыРасчета", Владелец);
			
		ИначеЕсли Найти(Имя, "БизнесПроцессСсылка") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.БизнесПроцесс;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("БизнесПроцессы", Владелец);
			
		ИначеЕсли Найти(Имя, "ТочкаМаршрутаБизнесПроцессаСсылка") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.ТочкаМаршрутаБизнесПроцесса;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("БизнесПроцессы", Владелец);
			
		ИначеЕсли Найти(Имя, "ЗадачаСсылка") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.Задача;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("Задачи", Владелец);
			
		ИначеЕсли Найти(Имя, "ПланОбменаСсылка") Тогда
			
			НовыйОбъект.Имя      = глОтделитьРазделителем(ИмяОбъекта);
			НовыйОбъект.Синоним  = НовыйОбъект.Имя;
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.ПланОбмена;
			НовыйОбъект.Родитель = НайтиОбъектРодительПоИмени("Планы обмена", Владелец);
			
		ИначеЕсли Имя = "КонстантыНабор" Тогда
			
			НовыйОбъект.Имя      = ИмяОбъекта;
			НовыйОбъект.Синоним  = "Набор констант";
			НовыйОбъект.Тип      = Перечисления.ТипыОбъектов.НаборКонстант;
			
		КонецЕсли;
		
	ИначеЕсли Тип(Справочник) = Тип("СправочникМенеджер.Свойства") Тогда

		Если НЕ ПустаяСтрока(Вид) Тогда
			
			НовыйОбъект.Вид = Перечисления.ВидыСвойств[Вид];
			
		КонецЕсли;
		
		Если Тип <> 0
			И НЕ Тип.Пустая() Тогда
			
			НовыйТип = НовыйОбъект.Типы.Добавить();
			НовыйТип.Тип = Тип;
			НовыйОбъект.ТипыСтрокой = глТипыСвойстваСтрокой(НовыйОбъект);
							
		КонецЕсли;
		
	КонецЕсли;
	
	НовыйОбъект.Наименование = Имя;
	
	Если Родитель <> Неопределено Тогда
		
		НовыйОбъект.Родитель = Родитель;
		
	КонецЕсли;
	
	Попытка
	
		НовыйОбъект.Записать();
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	НайденныйОбъект = НовыйОбъект.Ссылка;
		
	Возврат НайденныйОбъект;
	
КонецФункции // ПолучитьОбъект()

////////////////////////////////////////////////////////////////////////////////
// СОХРАНЕНИЕ ПРАВИЛ, АЛГОРИТМОВ, ЗАПРОСОВ

Функция НайтиИмеющеесяПКО(ПКС, ИмяПКО, СсылкаНаКонвертацию)
	
	ПКО = Справочники.ПравилаКонвертацииОбъектов.НайтиПоКоду(ИмяПКО ,,, СсылкаНаКонвертацию);
		
	Если НЕ ПКО.Пустая() Тогда
		ПКС.ПравилоКонвертации  = ПКО;
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

// Осуществляет сохранение конвертации, источника и приемника в соответствии с переданными параметрами.
//
// Параметры:
//  ОбщиеПеременные.СпособЗагрузкиКонвертации - вариант загрузки конвертации
//  ФлагНовыйИсточник              - ссылка на конфигурацию источник
//  ФлагНовыйПриемник              - ссылка на конфигурацию приемник
// 
Процедура Сохранить(ОбщиеПеременные) Экспорт

	Источник = ОбщиеПеременные.Конфигурация;
	ИнициализацияГруппОбъектов(Источник);

	ОбщиеПеременные.Вставить("Обновление", Ложь);
	
	//Конвертация
	Если ОбщиеПеременные.СпособЗагрузкиКонвертации = 0 Тогда
		
		ОбщиеПеременные.Обновление = Ложь;
		НоваяКонвертация = Справочники.СМП_УчетныеЗаписиОбменов.СоздатьЭлемент();
		НоваяКонвертация.Код = Новый УникальныйИдентификатор();
		НоваяКонвертация.Наименование = ОбщиеПеременные.ИмяКонвертацииДляЗагрузки;
        НоваяКонвертация.Источник = Источник;
		//НоваяКонвертация.Приемник = Приемник;
		НоваяКонвертация.Записать();
		//ОбщиеПеременные.КонвертацияСсылка = НоваяКонвертация.Ссылка;
		
	Иначе
        
		НоваяКонвертация = ОбщиеПеременные.КонвертацияСсылка.ПолучитьОбъект();
		НоваяКонвертация.Источник = Источник;
		//НоваяКонвертация.Приемник = Приемник;
		НоваяКонвертация.Записать();
        Если      ОбщиеПеременные.СпособЗагрузкиКонвертации = 1 Тогда
        	ОбщиеПеременные.Обновление = Ложь;

			//ВыборкаОбработки = Справочники.Обработки.Выбрать(, НоваяКонвертация.Ссылка);
			//Пока ВыборкаОбработки.Следующий() Цикл
			//	Обработка = ВыборкаОбработки.ПолучитьОбъект();
			//	Обработка.Удалить();
			//КонецЦикла;

			//ВыборкаПараметры = Справочники.Параметры.Выбрать(, НоваяКонвертация.Ссылка);
			//Пока ВыборкаПараметры.Следующий() Цикл
			//	Параметр = ВыборкаПараметры.ПолучитьОбъект();
			//	Параметр.Удалить();
			//КонецЦикла;

			//ВыборкаЗапросы = Справочники.Запросы.ВыбратьИерархически(, НоваяКонвертация.Ссылка);
			//Пока ВыборкаЗапросы.Следующий() Цикл
			//	Запрос = ВыборкаЗапросы.ПолучитьОбъект();
			//	Запрос.Удалить();
			//КонецЦикла;

			ВыборкаАлгоритмы = Справочники.Алгоритмы.ВыбратьИерархически(, НоваяКонвертация.Ссылка);
			Пока ВыборкаАлгоритмы.Следующий() Цикл
				Алгоритм = ВыборкаАлгоритмы.ПолучитьОбъект();
				Алгоритм.Удалить();
			КонецЦикла;

			//ВыборкаПОД = Справочники.ПравилаОчисткиДанных.ВыбратьИерархически(, НоваяКонвертация.Ссылка);
			//Пока ВыборкаПОД.Следующий() Цикл
			//	ПОД = ВыборкаПОД.ПолучитьОбъект();
			//	ПОД.Удалить();
			//КонецЦикла;

			//ВыборкаПВД = Справочники.ПравилаВыгрузкиДанных.ВыбратьИерархически(, НоваяКонвертация.Ссылка);
			//Пока ВыборкаПВД.Следующий() Цикл
			//	ПВД = ВыборкаПВД.ПолучитьОбъект();
			//	ПВД.Удалить();
			//КонецЦикла;

			ВыборкаПКО = Справочники.ПравилаКонвертацииОбъектов.ВыбратьИерархически(, НоваяКонвертация.Ссылка);
			Пока ВыборкаПКО.Следующий() Цикл
				ПКО = ВыборкаПКО.ПолучитьОбъект();
				ПКО.Удалить();
			КонецЦикла;
			
		ИначеЕсли ОбщиеПеременные.СпособЗагрузкиКонвертации = 2 Тогда
			
			ОбщиеПеременные.Обновление = Истина;

			//ВыборкаОбработки = Справочники.Обработки.Выбрать(, НоваяКонвертация.Ссылка);
			//Пока ВыборкаОбработки.Следующий() Цикл
			//	Обработка = ВыборкаОбработки.ПолучитьОбъект();
			//	Обработка.Удалить();
			//КонецЦикла;

			//ВыборкаПараметры = Справочники.Параметры.Выбрать(, НоваяКонвертация.Ссылка);
			//Пока ВыборкаПараметры.Следующий() Цикл
			//	Параметр = ВыборкаПараметры.ПолучитьОбъект();
			//	Параметр.Удалить();
			//КонецЦикла;
			
			ПолучитьВсеПравилаКонвертации(НоваяКонвертация.Ссылка, ОбщиеПеременные.мВсеПравилаКонвертации);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщиеПеременные.Конвертация.Свойство("УдалятьСопоставленныеОбъектыВПриемникеПриИхУдаленииВИсточнике") Тогда
		НоваяКонвертация.УдалятьСопоставленныеОбъектыВПриемникеПриИхУдаленииВИсточнике  = ОбщиеПеременные.Конвертация["УдалятьСопоставленныеОбъектыВПриемникеПриИхУдаленииВИсточнике"];
	Иначе
		НоваяКонвертация.УдалятьСопоставленныеОбъектыВПриемникеПриИхУдаленииВИсточнике = Ложь;
	КонецЕсли;
	//РежимСовместимости = Неопределено;
	//ОбщиеПеременные.Конвертация.Свойство("РежимСовместимости", РежимСовместимости);
	//Если РежимСовместимости <> Неопределено Тогда
	//	Если РежимСовместимости = "РежимСовместимостиСБСП21" Тогда
	//		НоваяКонвертация.РежимСовместимости = Перечисления.РежимСовместимости.РежимСовместимостиСБСП21;
	//	ИначеЕсли РежимСовместимости = "РежимСовместимостиСБСП20" Тогда
	//		НоваяКонвертация.РежимСовместимости = Перечисления.РежимСовместимости.РежимСовместимостиСБСП20;
	//	КонецЕсли;
	//Иначе
	//	НоваяКонвертация.РежимСовместимости = Перечисления.РежимСовместимости.ПустаяСсылка();
	//КонецЕсли;
	//Если ОбщиеПеременные.Конвертация.Свойство("ПослеЗагрузкиПравилОбмена") Тогда
	//	НоваяКонвертация.АлгоритмПослеЗагрузкиПравилОбмена  = ОбщиеПеременные.Конвертация["ПослеЗагрузкиПравилОбмена"];
	//КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПередПолучениемИзмененныхОбъектов") Тогда
		НоваяКонвертация.АлгоритмПередПолучениемИзмененныхОбъектов  = ОбщиеПеременные.Конвертация["ПередПолучениемИзмененныхОбъектов"];
	КонецЕсли;
	//Если ОбщиеПеременные.Конвертация.Свойство("ПослеПолученияИнформацииОбУзлахОбмена") Тогда
	//	НоваяКонвертация.АлгоритмПослеПолученияИнформацииОбУзлахОбмена  = ОбщиеПеременные.Конвертация["ПослеПолученияИнформацииОбУзлахОбмена"];
	//КонецЕсли;
	//Если ОбщиеПеременные.Конвертация.Свойство("ПередВыгрузкойДанных") Тогда
	//	НоваяКонвертация.АлгоритмПередВыгрузкойДанных     = ОбщиеПеременные.Конвертация["ПередВыгрузкойДанных"];
	//КонецЕсли;
	//Если ОбщиеПеременные.Конвертация.Свойство("ПослеВыгрузкиДанных") Тогда
	//	НоваяКонвертация.АлгоритмПослеВыгрузкиДанных      = ОбщиеПеременные.Конвертация["ПослеВыгрузкиДанных"];
	//КонецЕсли;
    Если ОбщиеПеременные.Конвертация.Свойство("ПередЗагрузкойДанных") Тогда
		НоваяКонвертация.АлгоритмПередЗагрузкойДанных     = ОбщиеПеременные.Конвертация["ПередЗагрузкойДанных"];
	КонецЕсли;
    Если ОбщиеПеременные.Конвертация.Свойство("ПослеЗагрузкиДанных") Тогда
		НоваяКонвертация.АлгоритмПослеЗагрузкиДанных      = ОбщиеПеременные.Конвертация["ПослеЗагрузкиДанных"];
	КонецЕсли;
	//Если ОбщиеПеременные.Конвертация.Свойство("ПередВыгрузкойОбъекта") Тогда
	//	НоваяКонвертация.АлгоритмПередВыгрузкойОбъекта    = ОбщиеПеременные.Конвертация["ПередВыгрузкойОбъекта"];
	//КонецЕсли;
    Если ОбщиеПеременные.Конвертация.Свойство("ПередКонвертациейОбъекта") Тогда
		НоваяКонвертация.АлгоритмПередКонвертациейОбъекта = ОбщиеПеременные.Конвертация["ПередКонвертациейОбъекта"];
	КонецЕсли;

	//Если ОбщиеПеременные.Конвертация.Свойство("ПослеВыгрузкиОбъекта") Тогда
	//	НоваяКонвертация.АлгоритмПослеВыгрузкиОбъекта = ОбщиеПеременные.Конвертация["ПослеВыгрузкиОбъекта"];
	//КонецЕсли;
    Если ОбщиеПеременные.Конвертация.Свойство("ПередЗагрузкойОбъекта") Тогда
		НоваяКонвертация.АлгоритмПередЗагрузкойОбъекта = ОбщиеПеременные.Конвертация["ПередЗагрузкойОбъекта"];
	КонецЕсли;
    Если ОбщиеПеременные.Конвертация.Свойство("ПослеЗагрузкиОбъекта") Тогда
		НоваяКонвертация.АлгоритмПослеЗагрузкиОбъекта = ОбщиеПеременные.Конвертация["ПослеЗагрузкиОбъекта"];
	КонецЕсли;
	
	//Если ОбщиеПеременные.Конвертация.Свойство("ПередОтправкойИнформацииОбУдалении") Тогда
	//	НоваяКонвертация.АлгоритмПередОтправкойИнформацииОбУдалении = ОбщиеПеременные.Конвертация["ПередОтправкойИнформацииОбУдалении"];
	//КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПриПолученииИнформацииОбУдалении") Тогда
		НоваяКонвертация.АлгоритмПриПолученииИнформацииОбУдалении = ОбщиеПеременные.Конвертация["ПриПолученииИнформацииОбУдалении"];
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПослеЗагрузкиПараметров") Тогда
		НоваяКонвертация.АлгоритмПослеЗагрузкиПараметров = ОбщиеПеременные.Конвертация["ПослеЗагрузкиПараметров"];
	КонецЕсли;
	
	НоваяКонвертация.Записать();	
	
	ОбщиеПеременные.мПКОДляПКС.Очистить();
	
	//Состояние("Создание объектов конфигураций источника и приемника");
	//мОбщееКоличествоСопоставленныхСтрокПКО = 0;
	ИнициализацияОбъектов(ОбщиеПеременные, Источник);

	//Состояние("Запись загруженных объектов");
	
	//мОбщееКоличествоЗаписанныхПКО = 0;
	ЗаписатьПКО(ОбщиеПеременные, ОбщиеПеременные.ТабПКО, ОбщиеПеременные.КонвертацияСсылка);

	//Состояние("Подстановка правил конвертации объектов в ПКС");
	//КоличествоПодставленныхПКО = 0;
	ОбщееКоличествоОбъектов = ОбщиеПеременные.мПКОДляПКС.Количество();
	Для каждого ПКОДляПКС из ОбщиеПеременные.мПКОДляПКС Цикл

		ПКО = Справочники.ПравилаКонвертацииОбъектов.НайтиПоКоду(ПКОДляПКС.Значение,,, НоваяКонвертация.ссылка);
		
		Если ПКОДляПКС.Ключ.ПравилоКонвертации <> ПКО Тогда
			ПКС = ПКОДляПКС.Ключ.ПолучитьОбъект();
			ПКС.ПравилоКонвертации  = ПКО;
			//ПКС.мУстанавливатьИмяИВидИсточникаПриемника = Ложь;
			ПКС.Записать();
		КонецЕсли;
		
		//КоличествоПодставленныхПКО = КоличествоПодставленныхПКО + 1;
		//Если КоличествоПодставленныхПКО%20 = 0 Тогда
		//	Состояние("Подставлено ПКО в ПКС: " + Строка(КоличествоПодставленныхПКО) + " из " + Строка(ОбщееКоличествоОбъектов));
		//КонецЕсли;

	КонецЦикла;
	
	ЗаписатьАлгоритмы(ОбщиеПеременные, ОбщиеПеременные.ТабАлгоритмы, ОбщиеПеременные.КонвертацияСсылка);

	//ЗаписатьЗапросы(ОбщиеПеременные, ТабЗапросы, ОбщиеПеременные.КонвертацияСсылка);

	//ЗаписатьПВД(ОбщиеПеременные, ТабПВД, ОбщиеПеременные.КонвертацияСсылка);
	
	//ЗаписатьПОД(ОбщиеПеременные, ТаблицаПравилОчистки, ОбщиеПеременные.КонвертацияСсылка);

	//// Сохраняем параметры
	//Для Каждого СтрокаТаблицы Из ТабПараметры Цикл
	//	
	//	НовыйПараметр                       = Справочники.Параметры.СоздатьЭлемент();
	//	НовыйПараметр.Владелец              = ОбщиеПеременные.КонвертацияСсылка;
	//	ЗаполнитьЗначенияСвойств(НовыйПараметр, СтрокаТаблицы);
	//	
	//	Если НЕ ПустаяСтрока(СтрокаТаблицы.ТипОбъекта) Тогда
	//		
	//		СпрОбъект = Справочники.Объекты.НайтиПоНаименованию(СтрокаТаблицы.ТипОбъекта, ИСТИНА, , ОбщиеПеременные.КонвертацияСсылка.Источник);
	//		Если СпрОбъект <> Справочники.Объекты.ПустаяСсылка() Тогда
	//			НовыйПараметр.ТипОбъекта = СпрОбъект;
	//		КонецЕсли;
	//		
	//	КонецЕсли;	
	//			
	//	Если НЕ ПустаяСтрока(СтрокаТаблицы.ПравилоКонвертации) Тогда
	//		
	//		ПКО = Справочники.ПравилаКонвертацииОбъектов.НайтиПоКоду(СтрокаТаблицы.ПравилоКонвертации, , , НоваяКонвертация.Ссылка);
	//		НовыйПараметр.ПравилоКонвертации = ПКО;
	//					
	//	КонецЕсли;
	//	
	//	НовыйПараметр.Записать();
	//	
	//КонецЦикла;

//	ЗаписатьОбработки(ТабОбработки, ОбщиеПеременные.КонвертацияСсылка);

	//Состояние("Удаление правил обмена");
	//КоличествоУдаленныхПравил = 0;
	ОбщееКоличествоПравил = ОбщиеПеременные.мВсеПравилаКонвертации.Количество();
	Для каждого СсылкаДляУдаления из ОбщиеПеременные.мВсеПравилаКонвертации Цикл
		
		//КоличествоУдаленныхПравил = КоличествоУдаленныхПравил + 1;
		//Если КоличествоУдаленныхПравил%20 = 0 Тогда
		//	Состояние("Удалено правил обмена: " + Строка(КоличествоУдаленныхПравил) + " из " + Строка(ОбщееКоличествоПравил));
		//КонецЕсли;
		
		Если СсылкаДляУдаления.Значение.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектДляУдаления = СсылкаДляУдаления.Значение.ПолучитьОбъект();
		ОбъектДляУдаления.УстановитьПометкуУдаления(Истина, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры // Сохранить()

Функция НайтиИлиСоздатьПКО(ОбщиеПеременные, ПКО, ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель)
	
	Если СоздаватьНовый Тогда
		
		Если ЭтоГруппа Тогда
			ПКО = Справочники.ПравилаКонвертацииОбъектов.СоздатьГруппу();
		Иначе	
			ПКО = Справочники.ПравилаКонвертацииОбъектов.СоздатьЭлемент();
		КонецЕсли;
		
		ПКО.Владелец     = Владелец;
		ПКО.Код          = Строка.Имя;
	КонецЕсли;
			
	Если Родитель <> Неопределено Тогда
		ПКО.Родитель = Родитель;
	КонецЕсли;

	Если ОбщиеПеременные.Обновление Тогда
		ОбщиеПеременные.мВсеПравилаКонвертации.Удалить(ПКО.Ссылка);
	КонецЕсли;

	ПКО.Наименование = Строка.Наименование;
	ПКО.Порядок      = Строка.Порядок;	
		
КонецФункции

Процедура ЗаписатьПКО(ОбщиеПеременные, СтрокиПКО, Владелец, Родитель = Неопределено)

	Перем ПКО;
	
	Для каждого Строка из СтрокиПКО.Строки Цикл
		
		СоздаватьНовый = Истина;

		Если ОбщиеПеременные.Обновление Тогда
			
			СсылкаПКО = Справочники.ПравилаКонвертацииОбъектов.НайтиПоКоду(Строка.Имя, , , Владелец);
			Если НЕ СсылкаПКО.Пустая() Тогда
				ПКО = СсылкаПКО.ПолучитьОбъект();
				СоздаватьНовый = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		НайтиИлиСоздатьПКО(ОбщиеПеременные, ПКО, Строка.ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель);
		
        Если Строка.ЭтоГруппа Тогда

			НоваяГруппаПКО = ПКО;
			
			//НоваяГруппаПКО.мЗагрузкаДанных = Истина;
			НоваяГруппаПКО.Записать();

			ЗаписатьПКО(ОбщиеПеременные, Строка, Владелец, НоваяГруппаПКО.Ссылка);

			ЗаписатьПКС(ОбщиеПеременные, Строка.Свойства, НоваяГруппаПКО.Ссылка, , Владелец);
			
		Иначе

			НовоеПКО = ПКО;
			
			НовоеПКО.НеЗапоминатьВыгруженные            = Строка.НеЗапоминатьВыгруженные;
			НовоеПКО.СинхронизироватьПоИдентификатору   = Строка.СинхронизироватьПоИдентификатору;
			НовоеПКО.ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли   = Строка.ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли;
            НовоеПКО.НеВыгружатьОбъектыСвойствПоСсылкам = Строка.НеВыгружатьОбъектыСвойствПоСсылкам;
			НовоеПКО.НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска = Строка.НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска;
			НовоеПКО.ИспользоватьБыстрыйПоискПриЗагрузке = Строка.ИспользоватьБыстрыйПоискПриЗагрузке;
			НовоеПКО.ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки = Строка.ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки;
			НовоеПКО.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD = Строка.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD;
			НовоеПКО.НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике = Строка.НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике;
			НовоеПКО.ГенерироватьНовыйНомерИлиКодЕслиНеУказан = Строка.ГенерироватьНовыйНомерИлиКодЕслиНеУказан;
			НовоеПКО.НеЗамещать                         = Строка.НеЗамещать;
			НовоеПКО.Источник                           = Строка.Источник;
			НовоеПКО.Приемник                           = Строка.Приемник;
			
			Если Не ПустаяСтрока(Строка.ПриоритетОбъектовОбмена) Тогда
				
				Если Строка.ПриоритетОбъектовОбмена = "Ниже" Тогда
					НовоеПКО.ПриоритетОбъектовОбмена = Перечисления.ПриоритетОбъектовОбмена.ПриоритетПоступившегоПриОбменеОбъектаНиже;
				ИначеЕсли Строка.ПриоритетОбъектовОбмена = "Совпадает" Тогда
					НовоеПКО.ПриоритетОбъектовОбмена = Перечисления.ПриоритетОбъектовОбмена.ПриоритетПоступившегоПриОбменеОбъектаСовпадает;
				КонецЕсли
				
			Иначе
				
				НовоеПКО.ПриоритетОбъектовОбмена = Перечисления.ПриоритетОбъектовОбмена.ПриоритетПоступившегоПриОбменеОбъектаВыше;
				
			КонецЕсли;

			Если Строка.ЕстьОбработчикПередВыгрузкой Тогда
				НовоеПКО.АлгоритмПередВыгрузкойОбъекта = Строка.ПередВыгрузкой;
			КонецЕсли;
			Если Строка.ЕстьОбработчикПриВыгрузке Тогда
				НовоеПКО.АлгоритмПриВыгрузкеОбъекта    = Строка.ПриВыгрузке;
			КонецЕсли;
			Если Строка.ЕстьОбработчикПослеВыгрузки Тогда
				НовоеПКО.АлгоритмПослеВыгрузкиОбъекта  = Строка.ПослеВыгрузки;
			КонецЕсли;
			Если Строка.ЕстьОбработчикПослеВыгрузкиВФайл Тогда
				НовоеПКО.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена  = Строка.ПослеВыгрузкиВФайл;
			КонецЕсли;
			Если Строка.ЕстьОбработчикПередЗагрузкой Тогда
				НовоеПКО.АлгоритмПередЗагрузкойОбъекта = Строка.ПередЗагрузкой;
			КонецЕсли;
			Если Строка.ЕстьОбработчикПриЗагрузке Тогда
				НовоеПКО.АлгоритмПриЗагрузкеОбъекта    = Строка.ПриЗагрузке;
			КонецЕсли;
			Если Строка.ЕстьОбработчикПослеЗагрузки Тогда
				НовоеПКО.АлгоритмПослеЗагрузкиОбъекта  = Строка.ПослеЗагрузки;
			КонецЕсли;
			Если Строка.ЕстьОбработчикПоследовательностейПолейПоиска Тогда
				НовоеПКО.АлгоритмПоследовательностьПолейПоиска  = Строка.ПоследовательностьПолейПоиска;
			КонецЕсли;
			
			НовоеПКО.НастройкаВариантовПоискаОбъектов.Очистить();
			Если Строка.НастройкаВариантовПоискаОбъектов <> Неопределено
				И Строка.НастройкаВариантовПоискаОбъектов.Количество() > 0 Тогда
				
				Для Каждого СтрокаТаблицы Из Строка.НастройкаВариантовПоискаОбъектов Цикл
					
					СтрокаТабЧасти = НовоеПКО.НастройкаВариантовПоискаОбъектов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, СтрокаТаблицы);
					
				КонецЦикла;
				
			КонецЕсли;
						
			//НовоеПКО.мЗагрузкаДанных = Истина;
			НовоеПКО.Записать();

			ЗаписатьПКС(ОбщиеПеременные, Строка.Свойства, НовоеПКО.Ссылка, , Владелец);
			ЗаписатьПКЗ(ОбщиеПеременные, Строка.Значения, НовоеПКО.Ссылка);
			
		КонецЕсли;
		
		//мОбщееКоличествоЗаписанныхПКО = мОбщееКоличествоЗаписанныхПКО + 1;
		//Если мОбщееКоличествоЗаписанныхПКО%5 = 0 Тогда
		//	Состояние("Записано: " + Строка(мОбщееКоличествоЗаписанныхПКО) + " из " + Строка(мОбщееКоличествоЗагруженныхПКО));
		//КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ЗаписатьПКО()

Функция НайтиИлиСоздатьПКС(ОбщиеПеременные, ПКС, ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель)
	
	Если СоздаватьНовый Тогда
		
		Если ЭтоГруппа Тогда
			ПКС = Справочники.ПравилаКонвертацииСвойств.СоздатьГруппу();
		Иначе
			ПКС = Справочники.ПравилаКонвертацииСвойств.СоздатьЭлемент();
		КонецЕсли;
		
		ПКС.Владелец     = Владелец;
		ПКС.Код          = Строка.Имя;
	КонецЕсли;
			
	Если Родитель <> Неопределено Тогда
		ПКС.Родитель = Родитель;
	КонецЕсли;

	Если ОбщиеПеременные.Обновление Тогда
		ОбщиеПеременные.мВсеПравилаКонвертации.Удалить(ПКС.Ссылка);
	КонецЕсли;

	ПКС.Наименование             = Строка.Наименование;
	ПКС.Порядок                  = Строка.Порядок;
	ПКС.Источник                 = Строка.Источник;
	ПКС.Приемник                 = Строка.Приемник;
	ПКС.ПолучитьИзВходящихДанных = Строка.ПолучитьИзВходящихДанных;
	ПКС.НеЗамещать               = Строка.НеЗамещать;
	ПКС.Отключить                = Строка.Отключить;
	
	ПКС.ВидИсточника             = Строка.ВидИсточника;
	ПКС.ВидПриемника             = Строка.ВидПриемника;
	
	ПКС.ТипИсточника 			= Строка.СтрокаТипИсточника;
	ПКС.ТипПриемника 			= Строка.СтрокаТипПриемника;
		
	ПКС.ИмяИсточника 			= Строка.СтрокаИсточник;
	ПКС.ИмяПриемника 			= Строка.СтрокаПриемник;
	
	Если Строка.ЕстьОбработчикПередВыгрузкой Тогда
		ПКС.АлгоритмПередВыгрузкойСвойства  = Строка.ПередВыгрузкой;
	КонецЕсли;
		
	Если Строка.ЕстьОбработчикПриВыгрузке Тогда
		ПКС.АлгоритмПриВыгрузкеСвойства     = Строка.ПриВыгрузке;
	КонецЕсли;

	Если Строка.ЕстьОбработчикПослеВыгрузки Тогда
		ПКС.АлгоритмПослеВыгрузкиСвойства   = Строка.ПослеВыгрузки;
	КонецЕсли;	
	
	//ПКС.мУстанавливатьИмяИВидИсточникаПриемника = Ложь;
		
КонецФункции

Процедура ЗаписатьПКС(ОбщиеПеременные, СтрокиПКС, Владелец, Родитель = Неопределено, Конвертация = Неопределено)

	Перем ПКС;
	
	Для каждого Строка из СтрокиПКС.Строки Цикл
		
		СоздаватьНовый = Истина;
			
		Если ОбщиеПеременные.Обновление Тогда
			СсылкаПКС = Справочники.ПравилаКонвертацииСвойств.НайтиПоКоду(Строка.Имя, , , Владелец);
			Если НЕ СсылкаПКС.Пустая() Тогда
				ПКС = СсылкаПКС.ПолучитьОбъект();
				СоздаватьНовый = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		НайтиИлиСоздатьПКС(ОбщиеПеременные, ПКС, Строка.ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель);

		Если Строка.ЭтоГруппа Тогда

			НоваяГруппаПКС = ПКС;
					
			Если Строка.ЕстьОбработчикПередОбработкойВыгрузки Тогда
				НоваяГруппаПКС.АлгоритмПередОбработкойВыгрузки = Строка.ПередОбработкойВыгрузки;
			КонецЕсли;

			Если Строка.ЕстьОбработчикПослеОбработкиВыгрузки Тогда
				НоваяГруппаПКС.АлгоритмПослеОбработкиВыгрузки  = Строка.ПослеОбработкиВыгрузки;
			КонецЕсли;

			//НоваяГруппаПКС.мЗагрузкаДанных = Истина;
			
			Если НЕ ПустаяСтрока(Строка.ПравилоКонвертации) Тогда
				
				НайденоПКО = НайтиИмеющеесяПКО(НоваяГруппаПКС, Строка.ПравилоКонвертации, Конвертация);
								
			КонецЕсли;
			
			НоваяГруппаПКС.ВыгружатьГруппуЧерезФайл = Строка.ВыгружатьГруппуЧерезФайл;
						
			НоваяГруппаПКС.Записать();
			
			Если НЕ ПустаяСтрока(Строка.ПравилоКонвертации)
				И НЕ НайденоПКО Тогда
				
				ОбщиеПеременные.мПКОДляПКС.Вставить(НоваяГруппаПКС.Ссылка, Строка.ПравилоКонвертации);
				
			КонецЕсли;

			ЗаписатьПКС(ОбщиеПеременные, Строка, Владелец, НоваяГруппаПКС.Ссылка, Конвертация);
			
		Иначе
			
			НовоеПКС = ПКС;
									
			НовоеПКС.Поиск                    = Строка.Поиск;
			
			НовоеПКС.АвтоматическиПриводитьЗначениеКДлинеПриемника = Строка.ПриводитьКДлине;
			НовоеПКС.ИмяПараметраДляПередачи = Строка.ИмяПараметраДляПередачи;
			НовоеПКС.ПоискПоДатеНаРавенство = Строка.ПоискПоДатеНаРавенство;
						
			//НовоеПКС.мЗагрузкаДанных = Истина;
			
			Если НЕ ПустаяСтрока(Строка.ПравилоКонвертации) Тогда
				
				НайденоПКО = НайтиИмеющеесяПКО(НовоеПКС, Строка.ПравилоКонвертации, Конвертация);
								
			КонецЕсли;
			
			НовоеПКС.Записать();
			
			Если НЕ ПустаяСтрока(Строка.ПравилоКонвертации)
				И НЕ НайденоПКО Тогда
				
				ОбщиеПеременные.мПКОДляПКС.Вставить(НовоеПКС.Ссылка, Строка.ПравилоКонвертации);
				
			КонецЕсли;		
						
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры // ЗаписатьПКС()

Функция НайтиИлиСоздатьПКЗ(ОбщиеПеременные, ПКЗ, ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель)
	
	Если СоздаватьНовый Тогда
		
		Если ЭтоГруппа тогда
			ПКЗ = Справочники.ПравилаКонвертацииЗначений.СоздатьГруппу();
		Иначе
			ПКЗ = Справочники.ПравилаКонвертацииЗначений.СоздатьЭлемент();
		КонецЕсли;
		
		ПКЗ.Владелец     = Владелец;
		ПКЗ.Код          = Строка.Имя;
	КонецЕсли;
			
	Если Родитель <> Неопределено Тогда
		ПКЗ.Родитель = Родитель;
	КонецЕсли;

	Если ОбщиеПеременные.Обновление Тогда
		ОбщиеПеременные.мВсеПравилаКонвертации.Удалить(ПКЗ.Ссылка);
	КонецЕсли;

	ПКЗ.Наименование = Строка.Наименование;
	ПКЗ.Комментарий  = Строка.Комментарий;
	ПКЗ.Описание     = Строка.Описание;
	ПКЗ.Порядок      = Строка.Порядок;
		
КонецФункции

Процедура ЗаписатьПКЗ(ОбщиеПеременные, СтрокиПКЗ, Владелец, Родитель = Неопределено)
	
	Перем ПКЗ;
	
	Для каждого Строка из СтрокиПКЗ.Строки Цикл

		СоздаватьНовый = Истина;

		Если ОбщиеПеременные.Обновление Тогда
			
			СсылкаПКЗ = Справочники.ПравилаКонвертацииЗначений.НайтиПоКоду(Строка.Имя, , , Владелец);
			Если НЕ СсылкаПКЗ.Пустая() Тогда
				ПКЗ = СсылкаПКЗ.ПолучитьОбъект();
				СоздаватьНовый = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		НайтиИлиСоздатьПКЗ(ОбщиеПеременные, ПКЗ, Строка.ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель);
		
		Если Строка.ЭтоГруппа Тогда

			ПКЗ.Записать();

			ЗаписатьПКЗ(ОбщиеПеременные, Строка, Владелец, ПКЗ.Ссылка);
			
		Иначе

			ПКЗ.Источник     = Строка.Источник;
			ПКЗ.Приемник     = Строка.Приемник;
			
			ПКЗ.Записать();
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры // ЗаписатьПКЗ()

Функция НайтиИлиСоздатьПВД(ОбщиеПеременные, ПВД, ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель)
	
	Если СоздаватьНовый Тогда
		
		Если ЭтоГруппа Тогда
			ПВД = Справочники.ПравилаВыгрузкиДанных.СоздатьГруппу();
		Иначе
			ПВД = Справочники.ПравилаВыгрузкиДанных.СоздатьЭлемент();
		КонецЕсли;
		
		ПВД.Владелец     = Владелец;
		ПВД.Код          = Строка.Имя;
	КонецЕсли;
	
	Если Родитель <> Неопределено Тогда
		ПВД.Родитель = Родитель;
	КонецЕсли;

	Если ОбщиеПеременные.Обновление Тогда
		ОбщиеПеременные.мВсеПравилаКонвертации.Удалить(ПВД.Ссылка);
	КонецЕсли;

	ПВД.Наименование = Строка.Наименование;
	ПВД.Порядок      = Строка.Порядок;
	ПВД.Комментарий  = Строка.Комментарий;
	ПВД.Описание     = Строка.Описание;
	ПВД.Отключить    = Строка.Отключить;
	
КонецФункции

Процедура ЗаписатьПВД(ОбщиеПеременные, СтрокиПВД, Владелец, Родитель = Неопределено)

	Перем ПВД;
	
	Для каждого Строка из СтрокиПВД.Строки Цикл
		
		СоздаватьНовый = Истина;
			
		Если ОбщиеПеременные.Обновление Тогда
			СсылкаПВД = Справочники.ПравилаВыгрузкиДанных.НайтиПоКоду(Строка.Имя, , , Владелец);
			Если НЕ СсылкаПВД.Пустая() Тогда
				ПВД = СсылкаПВД.ПолучитьОбъект();
				СоздаватьНовый = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		НайтиИлиСоздатьПВД(ОбщиеПеременные, ПВД, Строка.ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель);

		Если Строка.ЭтоГруппа Тогда

			//ПВД.мЗагрузкаДанных = Истина;
		
            ПВД.Записать();
			
			ЗаписатьПВД(ОбщиеПеременные, Строка, Владелец, ПВД.Ссылка);
			
		Иначе
			
			НовоеПВД = ПВД;

            Если НЕ ПустаяСтрока(Строка.СпособОтбораДанных) Тогда
				НовоеПВД.СпособОтбораДанных = Перечисления.СпособыОтбораДанных[Строка.СпособОтбораДанных];
			КонецЕсли;
			
			НовоеПВД.ВыбиратьДанныеДляВыгрузкиОднимЗапросом    = Строка.ВыбиратьДанныеДляВыгрузкиОднимЗапросом;
			НовоеПВД.НеВыгружатьОбъектыСозданныеВБазеПриемнике = Строка.НеВыгружатьОбъектыСозданныеВБазеПриемнике;

			Если НЕ ПустаяСтрока(Строка.ОбъектВыборки) Тогда
				НовоеПВД.ОбъектВыборки = ПолучитьОбъект(Строка.ОбъектВыборки, Справочники.Объекты, Владелец.Источник);
			КонецЕсли;

			Если НЕ ПустаяСтрока(Строка.ПравилоКонвертации) Тогда
				НовоеПВД.ПравилоКонвертации = Справочники.ПравилаКонвертацииОбъектов.НайтиПоКоду(Строка.ПравилоКонвертации,,, Владелец);
			КонецЕсли;

			НовоеПВД.АлгоритмПередОбработкойПравила = Строка.ПередОбработкой;
			НовоеПВД.АлгоритмПослеОбработкиПравила  = Строка.ПослеОбработки;
			НовоеПВД.АлгоритмПередВыгрузкойОбъекта  = Строка.ПередВыгрузкой;
			НовоеПВД.АлгоритмПослеВыгрузкиОбъекта   = Строка.ПослеВыгрузки;

			//НовоеПВД.мЗагрузкаДанных = Истина;
			НовоеПВД.Записать();

		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция НайтиИлиСоздатьПОД(ОбщиеПеременные, ПОД, ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель)
	
	Если СоздаватьНовый Тогда
		
		Если ЭтоГруппа Тогда
			ПОД = Справочники.ПравилаОчисткиДанных.СоздатьГруппу();
		Иначе
			ПОД = Справочники.ПравилаОчисткиДанных.СоздатьЭлемент();
		КонецЕсли;
		
		ПОД.Владелец     = Владелец;
		ПОД.Код          = Строка.Имя;
	КонецЕсли;
	
	Если Родитель <> Неопределено Тогда
		ПОД.Родитель = Родитель;
	КонецЕсли;

	Если ОбщиеПеременные.Обновление Тогда
		ОбщиеПеременные.мВсеПравилаКонвертации.Удалить(ПОД.Ссылка);
	КонецЕсли;

	ПОД.Наименование = Строка.Наименование;
	ПОД.Порядок      = Строка.Порядок;
	ПОД.Комментарий  = Строка.Комментарий;
	ПОД.Описание     = Строка.Описание;
	ПОД.Отключить    = Строка.Отключить;
	
КонецФункции

Процедура ЗаписатьПОД(ОбщиеПеременные, СтрокиПОД, Владелец, Родитель = Неопределено)

	Перем ПВД;
	
	Для каждого Строка из СтрокиПОД.Строки Цикл

		СоздаватьНовый = Истина;
			
		Если ОбщиеПеременные.Обновление Тогда
			СсылкаПОД = Справочники.ПравилаОчисткиДанных.НайтиПоКоду(Строка.Имя, , , Владелец);
			Если НЕ СсылкаПОД.Пустая() Тогда
				ПОД = СсылкаПОД.ПолучитьОбъект();
				СоздаватьНовый = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		НайтиИлиСоздатьПОД(ОбщиеПеременные, ПОД, Строка.ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель);
		
		Если Строка.ЭтоГруппа Тогда

			НоваяГруппаПОД = ПОД;
			
			НоваяГруппаПОД.Записать();
			
			ЗаписатьПОД(ОбщиеПеременные, Строка, Владелец, НоваяГруппаПОД.Ссылка);
			
		Иначе
			
			НовоеПОД = ПОД;

			СоздаватьНовый = Истина;
			
			Если НЕ ПустаяСтрока(Строка.СпособОтбораДанных) Тогда
				НовоеПОД.СпособОтбораДанных = Перечисления.СпособыОтбораДанных[Строка.СпособОтбораДанных];
			КонецЕсли;

			Если НЕ ПустаяСтрока(Строка.ОбъектВыборки) Тогда
				НовоеПОД.ОбъектВыборки = ПолучитьОбъект(Строка.ОбъектВыборки, Справочники.Объекты, Владелец.Источник);
			КонецЕсли;

			НовоеПОД.Непосредственно                = Строка.Непосредственно;
			НовоеПОД.АлгоритмПередОбработкойПравила = Строка.ПередОбработкой;
			НовоеПОД.АлгоритмПослеОбработкиПравила  = Строка.ПослеОбработки;
			НовоеПОД.АлгоритмПередУдалениемОбъекта  = Строка.ПередУдалением;

			НовоеПОД.Записать();

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция НайтиИлиСоздатьАлгоритм(ОбщиеПеременные, АЛГ, ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель)
	
	Если СоздаватьНовый Тогда
		Если ЭтоГруппа Тогда
			АЛГ = Справочники.Алгоритмы.СоздатьГруппу();
		Иначе
			АЛГ = Справочники.Алгоритмы.СоздатьЭлемент();
	    КонецЕсли;
		АЛГ.Владелец     = Владелец;
		АЛГ.Код          = Строка.Код;
	КонецЕсли;
	
	Если Родитель <> Неопределено Тогда
		АЛГ.Родитель = Родитель;
	КонецЕсли;

    Если ОбщиеПеременные.Обновление Тогда
		ОбщиеПеременные.мВсеПравилаКонвертации.Удалить(АЛГ.Ссылка);
	КонецЕсли;

	АЛГ.Комментарий = Строка.Комментарий;			
	    	
КонецФункции

Процедура ЗаписатьАлгоритмы(ОбщиеПеременные, СтрокиАлгоритмы, Владелец, Родитель = Неопределено)
	
	Перем АЛГ;

	Для каждого Строка из СтрокиАлгоритмы.Строки Цикл
		
		СоздаватьНовый = Истина;

		Если ОбщиеПеременные.Обновление Тогда
			СсылкаАлгоритм = Справочники.Алгоритмы.НайтиПоКоду(Строка.Код,,, Владелец);
			
			Если НЕ СсылкаАлгоритм.Пустая() Тогда
				АЛГ = СсылкаАлгоритм.ПолучитьОбъект();
				СоздаватьНовый = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		НайтиИлиСоздатьАлгоритм(ОбщиеПеременные, АЛГ, Строка.ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель);

		Если Строка.ЭтоГруппа Тогда

			АЛГ.Записать();

			ЗаписатьАлгоритмы(ОбщиеПеременные, Строка, Владелец, АЛГ.Ссылка);
			
		Иначе

			АЛГ.Алгоритм                = Строка.Алгоритм;
			АЛГ.ИспользуетсяПриЗагрузке = Строка.ИспользуетсяПриЗагрузке;
			АЛГ.Параметры				= Строка.Параметры;

			АЛГ.Записать();
			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ЗаписатьАлгоритмы()

Функция НайтиИлиСоздатьЗапрос(ОбщиеПеременные, ЗПР, ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель)
	
	Если СоздаватьНовый Тогда
		Если ЭтоГруппа Тогда
			ЗПР = Справочники.Запросы.СоздатьГруппу();
		Иначе
			ЗПР = Справочники.Запросы.СоздатьЭлемент();
	    КонецЕсли;
		ЗПР.Владелец     = Владелец;
		
		ЗПР.Код          = Строка.Код;
	КонецЕсли;
	
	Если Родитель <> Неопределено Тогда
		ЗПР.Родитель = Родитель;
	КонецЕсли;

	Если ОбщиеПеременные.Обновление Тогда
		ОбщиеПеременные.мВсеПравилаКонвертации.Удалить(ЗПР.Ссылка);
	КонецЕсли;

	ЗПР.Комментарий = Строка.Комментарий;			
		    	
КонецФункции

Процедура ЗаписатьЗапросы(ОбщиеПеременные, СтрокиЗапросы, Владелец, Родитель = Неопределено)
	
	Перем ЗПР;

	Для каждого Строка из СтрокиЗапросы.Строки Цикл

		СоздаватьНовый = Истина;

		Если ОбщиеПеременные.Обновление Тогда
			СсылкаЗапросы = Справочники.Запросы.НайтиПоКоду(Строка.Код,,, Владелец);
			Если НЕ СсылкаЗапросы.Пустая() Тогда
				ЗПР = СсылкаЗапросы.ПолучитьОбъект();
				СоздаватьНовый = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		НайтиИлиСоздатьЗапрос(ОбщиеПеременные, ЗПР, Строка.ЭтоГруппа, СоздаватьНовый, Владелец, Строка, Родитель);
		
		Если Строка.ЭтоГруппа Тогда

			ЗПР.Записать();

			ЗаписатьЗапросы(ОбщиеПеременные, Строка, Владелец, ЗПР.Ссылка);
			
		Иначе

			ЗПР.ТекстЗапроса            = Строка.ТекстЗапроса;
			ЗПР.ИспользуетсяПриЗагрузке = Строка.ИспользуетсяПриЗагрузке;

			ЗПР.Записать();
			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ЗаписатьЗапросы()

//Процедура ЗаписатьОбработки(СтрокиОбработки, Владелец)

//	Для каждого Строка из СтрокиОбработки Цикл

//		НоваяОбработка = Справочники.Обработки.СоздатьЭлемент();
//		НоваяОбработка.Владелец = Владелец;
//		НоваяОбработка.Код      = Строка.Код;

//		НоваяОбработка.Наименование            = Строка.Наименование;
//		НоваяОбработка.Комментарий             = Строка.Комментарий;
//		НоваяОбработка.ИспользуетсяПриВыгрузке = Строка.ИспользуетсяПриВыгрузке;
//		НоваяОбработка.ИспользуетсяПриЗагрузке = Строка.ИспользуетсяПриЗагрузке;
//		НоваяОбработка.ЭтоОбработкаНастройки   = Строка.ЭтоОбработкаНастройки;
//		НоваяОбработка.ХранилищеОбработки      = Строка.Обработка;

//		Параметры = Строка.Параметры;
//		Пока(НЕ ПустаяСтрока(Параметры)) Цикл
//			ОстатокСтроки = глОтделитьРазделителем(Параметры, ",");
//			НовыйПараметр = НоваяОбработка.Параметры.Добавить();
//			НовыйПараметр.Параметр = Справочники.Параметры.НайтиПоКоду(СокрЛП(Параметры),,, Владелец);
//			Параметры = ОстатокСтроки;
//		КонецЦикла;

//		НоваяОбработка.Записать();
//			
//	КонецЦикла;

//КонецПроцедуры // ЗаписатьОбработки()

////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ РЕКВИЗИТОВ И МОДУЛЬНЫХ ПЕРЕМЕННЫХ

Функция СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, НаименованиеЭлемента, ИмяЭлемента = "", СинонимЭлемента = "", Тип = Неопределено)
	
	ЭлементКонфигурации = Справочники.Объекты.НайтиПоНаименованию(НаименованиеЭлемента, 1,, Владелец);
	
	Если ЭлементКонфигурации.Пустая() Тогда
		
		Если Тип = Неопределено Тогда
			НовыйЭлемент = Справочники.Объекты.СоздатьГруппу();
			//НовыйЭлемент.УстановитьНовыйКод();
		Иначе
			НовыйЭлемент = Справочники.Объекты.СоздатьЭлемент();
		КонецЕсли;	

        НовыйЭлемент.Владелец     = Владелец;
        НовыйЭлемент.Имя          = ?(ПустаяСтрока(ИмяЭлемента), глПолучитьИмяГруппыОбъектовПоНаименованию(НаименованиеЭлемента), ИмяЭлемента);
		НовыйЭлемент.Наименование = НаименованиеЭлемента;
		НовыйЭлемент.Синоним      = ?(ПустаяСтрока(СинонимЭлемента), ИмяЭлемента, СинонимЭлемента);
		Если Тип <> Неопределено Тогда
			НовыйЭлемент.Тип = Тип;
		КонецЕсли;
		НовыйЭлемент.Записать();
		
		Возврат НовыйЭлемент.Ссылка;
		
	Иначе	
		
		Возврат ЭлементКонфигурации;
		
	КонецЕсли;	
	
КонецФункции

// Осуществляет инициализацию объектов, определяющих базовые типы
// Параметры:
//  Владелец       - ссылка на элемент справочника "Конфигурации",
//                   являющуюся владельцем инициализируемых объектов.
// 
Процедура ИнициализацияГруппОбъектов(Владелец)

	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "КонстантыНабор", "КонстантыНабор", "Набор констант", Перечисления.ТипыОбъектов.НаборКонстант);
	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "Число", "Число", "Число", Перечисления.ТипыОбъектов.Число);
	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "Строка", "Строка", "Строка", Перечисления.ТипыОбъектов.Строка);
	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "Дата", "Дата", "Дата", Перечисления.ТипыОбъектов.Дата);


	Если Владелец.Приложение <> Перечисления.Приложения.Предприятие77 Тогда
		
		СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "Булево", "Булево", "Булево", Перечисления.ТипыОбъектов.Булево);
		СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "ХранилищеЗначения", "ХранилищеЗначения", "Хранилище значения", Перечисления.ТипыОбъектов.ХранилищеЗначения);
		СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "УникальныйИдентификатор", "УникальныйИдентификатор", "Уникальный идентификатор", Перечисления.ТипыОбъектов.УникальныйИдентификатор);
		
	КонецЕсли;	

КонецПроцедуры // ИнициализацияГруппОбъектов()

// Осуществляет выбор всех правил конвертации в сооветствие
// Параметры:
//  Конвертация           - ссылка на элемент справочника "Конвертации".
//  ВсеПравилаКонвертации - соответствие, в которое будут выгружены правила.
// 
Процедура ПолучитьВсеПравилаКонвертации(Конвертация, ВсеПравилаКонвертации)

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Конвертация", Конвертация);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилаКонвертацииОбъектов.Ссылка
	|ИЗ
	|	Справочник.ПравилаКонвертацииОбъектов КАК ПравилаКонвертацииОбъектов
	|ГДЕ
	|	ПравилаКонвертацииОбъектов.Владелец = &Конвертация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПравилаКонвертацииСвойств.Ссылка
	|ИЗ
	|	Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
	|ГДЕ
	|	ПравилаКонвертацииСвойств.Владелец.Владелец = &Конвертация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПравилаКонвертацииЗначений.Ссылка
	|ИЗ
	|	Справочник.ПравилаКонвертацииЗначений КАК ПравилаКонвертацииЗначений
	|ГДЕ
	|	ПравилаКонвертацииЗначений.Владелец.Владелец = &Конвертация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПравилаВыгрузкиДанных.Ссылка
	|ИЗ
	|	Справочник.ПравилаВыгрузкиДанных КАК ПравилаВыгрузкиДанных
	|ГДЕ
	|	ПравилаВыгрузкиДанных.Владелец = &Конвертация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПравилаОчисткиДанных.Ссылка
	|ИЗ
	|	Справочник.ПравилаОчисткиДанных КАК ПравилаОчисткиДанных
	|ГДЕ
	|	ПравилаОчисткиДанных.Владелец = &Конвертация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Алгоритмы.Ссылка
	|ИЗ
	|	Справочник.Алгоритмы КАК Алгоритмы
	|ГДЕ
	|	Алгоритмы.Владелец = &Конвертация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Запросы.Ссылка
	|ИЗ
	|	Справочник.Запросы КАК Запросы
	|ГДЕ
	|	Запросы.Владелец = &Конвертация"
	;

	ВыборкаРезЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);

	Пока ВыборкаРезЗапроса.Следующий() Цикл
		ВсеПравилаКонвертации.Вставить(ВыборкаРезЗапроса.Ссылка, ВыборкаРезЗапроса.Ссылка);
	КонецЦикла;

КонецПроцедуры

// Отделяет от исходной строки левую часть до разделителя и присваивает это значение исходной строке,
// а правую часть возвращает.
//
// Параметры: 
//  Стр            - Исходная строка.
//  Типы           - Подстрока разделитель.
//  Режим          - 1, разделитель в левой части строки
//                   2, разделитель в правой части строки
//
// Возвращаемое значение:
//  Строка, содержащая правую часть исходной строки после разделителя.
//
Функция глОтделитьРазделителем(Стр, Знач Разделитель = ".", Режим = 0, ЕслиНетРазделителяВернутьИсходнуюСтроку = Ложь) Экспорт

	ПраваяЧасть	= "";
	Разделитель	= Найти(Стр, Разделитель);
	Если Разделитель > 0 Тогда
		
		ПраваяЧасть	= Сред(Стр, Разделитель + ?(Режим = 2, 0, 1));
		Стр			= СокрЛП(Лев(Стр, Разделитель - ?(Режим = 1, 0, 1)));
		
	ИначеЕсли ЕслиНетРазделителяВернутьИсходнуюСтроку = Истина Тогда
		
		ПраваяЧасть = СокрЛП(Стр);
		Стр = "";
		
	КонецЕсли;

	Возврат(ПраваяЧасть);
	
КонецФункции // глОтделитьРазделителем()

Функция глПолучитьИмяГруппыОбъектовПоНаименованию(Знач Наименование) Экспорт
	
	Если      Наименование = "Справочники"             Тогда Возврат "Справочники";
	ИначеЕсли Наименование = "Документы"               Тогда Возврат "Документы";
	ИначеЕсли Наименование = "Перечисления"            Тогда Возврат "Перечисления";
	ИначеЕсли Наименование = "РегистрыСведений"        Тогда Возврат "Регистры сведений";
	ИначеЕсли Наименование = "ПланыОбмена"             Тогда Возврат "Планы обмена";
	ИначеЕсли Наименование = "ПланыВидовХарактеристик" Тогда Возврат "Планы видов характеристик";
	ИначеЕсли Наименование = "ПланыВидовРасчета"       Тогда Возврат "Планы видов расчета";
	ИначеЕсли Наименование = "РегистрыБухгалтерии"     Тогда Возврат "Регистры бухгалтерии";
	ИначеЕсли Наименование = "РегистрыРасчета"         Тогда Возврат "Регистры расчета";
	ИначеЕсли Наименование = "БизнесПроцессы"          Тогда Возврат "Бизнес-процессы";
	ИначеЕсли Наименование = "КонстантыНабор"          Тогда Возврат "Набор констант";
	ИначеЕсли Наименование = "Задачи"                  Тогда Возврат "Задачи";
	ИначеЕсли Наименование = "РегистрыНакопления"      Тогда Возврат "Регистры накопления";
	ИначеЕсли Наименование = "ПланыСчетов"             Тогда Возврат "Планы счетов";
	ИначеЕсли Наименование = "ХранилищеЗначения"       Тогда Возврат "Хранилище значения";
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

// Формирует строковое представление типа для свойства или для описания типов.
//
// Параметры: 
//  Свойство       - Свойство, для которого необходимо получить строковое представление типа.
//  Типы           - Типы, для которых необходимо получить строковое представление.
//
// Возвращаемое значение:
//  Строка, содержащая представление типа.
//
Функция глТипыСвойстваСтрокой(Свойство) Экспорт

    Рез = "";

	Типы = Свойство.Типы;
		
	Для каждого Стр Из Типы Цикл

		ИмяТипа = СокрЛП(Стр.Тип);
		
		Если ИмяТипа = "Строка" Тогда
			
			Если Свойство.КвалификаторыСтроки_Длина = 0 Тогда
				ИмяТипа = ИмяТипа + " (Неогр)";
			Иначе
				Если Свойство.КвалификаторыСтроки_Фиксированная Тогда
					ИмяТипа = ИмяТипа + " (Ф" + Свойство.КвалификаторыСтроки_Длина + ")";
				Иначе
					ИмяТипа = ИмяТипа + " (П" + Свойство.КвалификаторыСтроки_Длина + ")";
				КонецЕсли; 
			КонецЕсли; 
			
		ИначеЕсли ИмяТипа = "Число" Тогда
			
			ИмяТипа = ИмяТипа + " (" + Свойство.КвалификаторыЧисла_Длина + "." + Свойство.КвалификаторыЧисла_Точность + ")";
			
		ИначеЕсли ИмяТипа = "Дата" Тогда
			
			ИмяТипа = Свойство.КвалификаторыДаты_Состав;
			Если ПустаяСтрока(ИмяТипа) Тогда
				
				ИмяТипа = "Дата"; // если не известно что за дата - просто пишем, что дата и все
				
			КонецЕсли;
			
		ИначеЕсли Свойство.ЭтоГруппа Тогда
			ИмяТипа = СтрЗаменить(ИмяТипа, "РегистрСведенийЗапись",		"РегистрСведенийНаборЗаписей");
			ИмяТипа = СтрЗаменить(ИмяТипа, "РегистрНакопленияЗапись",	"РегистрНакопленияНаборЗаписей");
			ИмяТипа = СтрЗаменить(ИмяТипа, "РегистрБухгалтерииЗапись",	"РегистрБухгалтерииНаборЗаписей");
			ИмяТипа = СтрЗаменить(ИмяТипа, "РегистрРасчетаЗапись",		"РегистрРасчетаНаборЗаписей");
		КонецЕсли; 
		
        Рез = Рез + ", " + ИмяТипа;
		
	КонецЦикла; 

	Возврат Прав(Рез, СтрДлина(Рез)-2);
	
КонецФункции // глТипыСвойстваСтрокой() 

Функция ПолучитьИмяФайлаДляЧтенияДанных(ОбщиеПеременные, ФайлЗапакован, ФлагОшибки)
	ИмяФайлаДляЧтенияДанных = "";

	Файл = Новый Файл(ОбщиеПеременные.ИмяФайлаПравил);
	Если НЕ Файл.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не найден файл с именем'") + ": " + ОбщиеПеременные.ИмяФайлаПравил);
		ФлагОшибки = Истина;
	ИначеЕсли НЕ Файл.ЭтоФайл() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Файл является каталогом'") + ": " + ОбщиеПеременные.ИмяФайлаПравил);
		ФлагОшибки = Истина;
	КонецЕсли;
	Возврат ОбщиеПеременные.ИмяФайлаПравил;
КонецФункции

#КонецОбласти

#КонецЕсли