
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ЗапуститьОбработкуСообщения(Элементы.Список.ТекущиеДанные.УчетнаяЗаписьОбмена, Элементы.Список.ТекущиеДанные.УникальныйИдентификатор);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Запуск обработки сообщения.
//
// Параметры:
//   <Параметр1> - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//   <Параметр2> - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервереБезКонтекста
Процедура ЗапуститьОбработкуСообщения(УчетнаяЗапись, ИдентификаторСообщения) 
	
	СМП_ОнлайнОбмен.ОбработатьВходящиеСообщения(, УчетнаяЗапись, ИдентификаторСообщения,, Истина);
	
КонецПроцедуры //ЗапуститьОбработкуСообщения

#КонецОбласти

