
#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого ДанныеСтроки Из Строки Цикл
		ДанныеСтроки.Значение.Данные.ДанныеПредставление = ЗначениеИзСтрокиВнутр(ДанныеСтроки.Значение.Данные.Данные);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ОбработатьСообщениеНаСервере(Элементы.Список.ТекущиеДанные.УникальныйИдентификатор);
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Запускает процес формирования исходящих сообщений сообщения.
//
// Параметры:
//   Учетнаязаписьобмена - СправочникСсылка.СМП_УчетныеЗаписиОбменов - учетная запись в рамках которой обрабатывается сообщение.
//   ИдентификаторСообщения - Строка - уникальный идентификатор сообщения.
//
&НаСервереБезКонтекста
Процедура ОбработатьСообщениеНаСервере(ИдентификаторСообщения) 
	
	// Отладка
	СМП_ОнлайнОбмен.СформироватьОтправитьИсходящиеСообщения(,, ИдентификаторСообщения,, Истина);
	
КонецПроцедуры //ОбработатьСообщениеНаСервере

#КонецОбласти