////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// ПолучитьТаблицуПравилРегистрацииДокументов.
//
// Возвращаемое значение:
//   ТаблицаЗначений - см. СМП_ОнлайнОбменПовтИсп.ИнициализироватьТаблицуПРО() 
//
Функция ПолучитьТаблицуПравилРегистрацииДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаПРД = ИнициализироватьТаблицуПРД();
	МассивОнлайнОбменов = ПолучитьУчетныеЗаписиОнлайнОбменов();
	Если МассивОнлайнОбменов.Количество() = 0 Тогда
		Возврат ТаблицаПРД;
	КонецЕсли;
	
	Для Каждого ОбменСсылка Из МассивОнлайнОбменов Цикл
		
		ОбменОбъект = ОбменСсылка.ПолучитьОбъект();
		Если ОбменОбъект.ОбъектыКВыгрузке.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ТаблицаДокументов = ОбменОбъект.ОбъектыКВыгрузке;
		
		Для Каждого СтрокаТЧ Из ТаблицаДокументов Цикл
			
			СтрокаПравило = ТаблицаПРД.Добавить();
			СтрокаПравило.УчетнаяЗапись = ОбменСсылка;
			СтрокаПравило.ДатаНачалаВыгрузкиДокументов = ОбменОбъект.ДатаНачалаВыгрузкиДокументов;
			СтрокаПравило.ИмяДокумента = СтрокаТЧ.ПолноеИмяОбъекта;
			СтрокаПравило.СхемаКД = СтрокаТЧ.СкдДляОтборов.Получить();
			
		КонецЦикла;
		
	КонецЦикла;

	Возврат ТаблицаПРД;
	
КонецФункции // ПолучитьТаблицуПравилРегистрацииДокументов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает массив учетных записей действующих онлайн обменов.
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.СМП_УчетныеЗаписиОбменов
//
Функция ПолучитьУчетныеЗаписиОнлайнОбменов() 
	
	МассивОнлайнОбменов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМП_УчетныеЗаписиОбменов.Ссылка КАК ОбменСсылка
	|ИЗ
	|	Справочник.СМП_УчетныеЗаписиОбменов КАК СМП_УчетныеЗаписиОбменов
	|ГДЕ
	|	СМП_УчетныеЗаписиОбменов.ПометкаУдаления = ЛОЖЬ";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		МассивОнлайнОбменов = Результат.Выгрузить().ВыгрузитьКолонку("ОбменСсылка");
	КонецЕсли;
	
	Возврат МассивОнлайнОбменов;
	
КонецФункции // ПолучитьУчетныеЗаписиОнлайнОбменов

// Возвращает пустую таблицу для правил регистрации документов.
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция ИнициализироватьТаблицуПРД() 
	
	ТаблицаПРД = Новый ТаблицаЗначений;
	ТаблицаПРД.Колонки.Добавить("УчетнаяЗапись", Новый ОписаниеТипов("СправочникСсылка.СМП_УчетныеЗаписиОбменов"));
	ТаблицаПРД.Колонки.Добавить("ДатаНачалаВыгрузкиДокументов", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаПРД.Колонки.Добавить("ИмяДокумента", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ТаблицаПРД.Колонки.Добавить("СхемаКД", Новый ОписаниеТипов("СхемаКомпоновкиДанных"));
	
	Возврат ТаблицаПРД;
	
КонецФункции // ИнициализироватьТаблицуПРД


#КонецОбласти