#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Изменение порядка правил
//
// Параметры:
//   Правило - СправочникСсылка.ПравилаКонвертацииСвойств - правило, для которого изменяется порядок
//   НаправлениеСдвига - Число - признак увеличения или уменьшения
//
Процедура ИзменитьПорядок(Правило, НаправлениеСдвига) Экспорт
	
	мРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Правило, "Родитель, Владелец");
	
	НачатьТранзакцию();
	
	Спис = Новый СписокЗначений;
	ТекЭлемент = Неопределено;
	Выборка = Справочники.ПравилаКонвертацииСвойств.Выбрать(мРеквизиты.Родитель, мРеквизиты.Владелец, , "Порядок");
	
	Пока Выборка.Следующий() Цикл
		
		НовЭлемент = Спис.Добавить(Выборка.Ссылка, Строка(Выборка.Порядок));
		Если Выборка.Ссылка = Правило Тогда
			ТекЭлемент = НовЭлемент;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекИнд = Спис.Индекс(ТекЭлемент);
	Если ТекИнд >= 0 Тогда
		
		Если ((НаправлениеСдвига = 1) И (ТекИнд < Спис.Количество() - 1)) ИЛИ ((НаправлениеСдвига = -1) И (ТекИнд > 0)) Тогда
			Спис.Сдвинуть(ТекИнд, НаправлениеСдвига);
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого ЭлементСписка из Спис Цикл
		
		Порядок = (Спис.Индекс(ЭлементСписка) + 1) * 50;
		ИсходныйПорядок = Число(ЭлементСписка.Представление);
		
		Если ИсходныйПорядок <> Порядок Тогда
			
			Элем = ЭлементСписка.Значение.ПолучитьОбъект();
			Элем.Порядок = Порядок;
			Попытка
				Элем.Записать();
			Исключение
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры //ИзменитьПроядок

// Поиск ПКО для подстановки в ПКС:
//
// Параметры:
//   Владелец - СправочникСсылка.СМП_УчетныеЗаписиОбменов - владелец ПКО.
//   Источник - СправочникСсылка.Свойства - реквизит источник.
//   Приемник - СправочникСсылка.Свойства - реквизит приемник.
//   ПрименитьНечеткийПоиск - булево - если несколько типов у источника или приемника.
//
// Возвращаемое значение:
//   СписокЗначений - Список найденых ПКО.
//
Функция НайтиПравилаКО(Владелец, Источник, Приемник, ПрименитьНеЧеткийПоиск = Ложь) Экспорт

	НайденныеПКО  = Новый СписокЗначений;
	
	Если НЕ ПрименитьНеЧеткийПоиск Тогда
		
		Если Источник.Типы.Количество() <> 1
			ИЛИ Приемник.Типы.Количество() <> 1 Тогда
			
			Возврат НайденныеПКО;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТипыИсточника = Новый СписокЗначений;
	ТипыПриемника = Новый СписокЗначений;

	Если НЕ Источник.Пустая() Тогда
		Для каждого Типы из Источник.Типы Цикл
			ТипыИсточника.Добавить(Типы.Тип);
		КонецЦикла;
	КонецЕсли;

	Если НЕ Приемник.Пустая() Тогда
		Для каждого Типы из Приемник.Типы Цикл
			ТипыПриемника.Добавить(Типы.Тип);
		КонецЦикла;
	Иначе
		Возврат НайденныеПКО;
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Владелец",           Владелец);
	Запрос.УстановитьПараметр("ТипыИсточника",      ТипыИсточника);
	Запрос.УстановитьПараметр("ТипыПриемника",      ТипыПриемника);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаКонвертацииОбъектов.Ссылка КАК ПКО
	|ИЗ
	|	Справочник.ПравилаКонвертацииОбъектов КАК ПравилаКонвертацииОбъектов
	|
	|ГДЕ
	|	ПравилаКонвертацииОбъектов.Владелец = &Владелец И
	|	ПравилаКонвертацииОбъектов.Приемник В(&ТипыПриемника)";

	Если ТипыИсточника.Количество() <> 0 Тогда
		Запрос.Текст = Запрос.Текст + "И ПравилаКонвертацииОбъектов.Источник В(&ТипыИсточника)";
	КонецЕсли;

	РезЗапроса = Запрос.Выполнить();

	РезТаблица = РезЗапроса.Выгрузить();

	Для каждого Строка из РезТаблица Цикл
		
		НайденныеПКО.Добавить(Строка.ПКО);
		
	КонецЦикла;

	Возврат НайденныеПКО;

КонецФункции


#КонецОбласти

#КонецЕсли
