#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Изменение порядка правил
//
// Параметры:
//   Правило - СправочникСсылка.ПравилаКонвертацииСвойств - правило, для которого изменяется порядок
//   НаправлениеСдвига - Число - признак увеличения или уменьшения
//
Процедура ИзменитьПорядок(Правило, НаправлениеСдвига) Экспорт
	
	мРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Правило, "Родитель, Владелец");
	
	НачатьТранзакцию();
	
	Спис = Новый СписокЗначений;
	ТекЭлемент = Неопределено;
	Выборка = Справочники.ПравилаКонвертацииСвойств.Выбрать(мРеквизиты.Родитель, мРеквизиты.Владелец, , "Порядок");
	
	Пока Выборка.Следующий() Цикл
		
		НовЭлемент = Спис.Добавить(Выборка.Ссылка, Строка(Выборка.Порядок));
		Если Выборка.Ссылка = Правило Тогда
			ТекЭлемент = НовЭлемент;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекИнд = Спис.Индекс(ТекЭлемент);
	Если ТекИнд >= 0 Тогда
		
		Если ((НаправлениеСдвига = 1) И (ТекИнд < Спис.Количество() - 1)) ИЛИ ((НаправлениеСдвига = -1) И (ТекИнд > 0)) Тогда
			Спис.Сдвинуть(ТекИнд, НаправлениеСдвига);
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого ЭлементСписка из Спис Цикл
		
		Порядок = (Спис.Индекс(ЭлементСписка) + 1) * 50;
		ИсходныйПорядок = Число(ЭлементСписка.Представление);
		
		Если ИсходныйПорядок <> Порядок Тогда
			
			Элем = ЭлементСписка.Значение.ПолучитьОбъект();
			Элем.Порядок = Порядок;
			Попытка
				Элем.Записать();
			Исключение
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры //ИзменитьПроядок

#КонецОбласти

#КонецЕсли
