
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		ОтборСвойства = СписокСвойств.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборСвойства.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ОтборСвойства.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборСвойства.ПравоеЗначение = Объект.Ссылка;
		ОтборСвойства.Использование = Истина;
		ОтборСвойства.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ОтборЗначения = СписокЗначений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЗначения.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ОтборЗначения.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЗначения.ПравоеЗначение = Объект.Ссылка;
		ОтборЗначения.Использование = Истина;
		ОтборЗначения.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти