
Процедура ЗагрузитьРедактор(Форма, ИмяПоля, НачальноеНаполнение, КВФ, СледующийФайл = "css") Экспорт
	
	Если СледующийФайл <> "" Тогда
		ОП = Новый ОписаниеОповещения("ПриЗаписиЗавершение", ЭтотОбъект, 
		Новый Структура("Форма,ИмяПоля,НачальноеНаполнение,КВФ,ТекущийФайл", Форма, ИмяПоля, НачальноеНаполнение, КВФ, СледующийФайл));
	КонецЕсли;
	
	Если СледующийФайл = "css" тогда
		Макет = СМП_РедакторКодаСервер.ПолучитьМакет("РедакторКодаCss");
		Макет.НачатьЗапись(ОП, КВФ + "style1c.css");
	ИначеЕсли СледующийФайл = "lib" тогда
		Макет = СМП_РедакторКодаСервер.ПолучитьМакет("РедакторКодаLib");
		Макет.НачатьЗапись(ОП, КВФ + "lib1c.js");
	ИначеЕсли СледующийФайл = "mode" тогда
		Макет = СМП_РедакторКодаСервер.ПолучитьМакет("РедакторКодаMode");
		Макет.НачатьЗапись(ОП, КВФ + "mode1c.js");
	Иначе
		
		КВФ = СтрЗаменить(КВФ, "\", "/");
		
		Макет = СМП_РедакторКодаСервер.ПолучитьМакет("РедакторКодаIndex");
		Макет.ЗаменитьСтроку(6, "<link rel='stylesheet' href='file:///" + КВФ + "style1c.css'>");
		Макет.ЗаменитьСтроку(7, "<script type='text/javascript' src='file:///" + КВФ + "lib1c.js'></script>");
		Макет.ЗаменитьСтроку(8, "<script type='text/javascript' src='file:///" + КВФ + "mode1c.js'></script>");
		
		КодРедактора = Макет.ПолучитьТекст();
		НачальноеНаполнение = СтрЗаменить(НачальноеНаполнение, Символы.ПС, "\n");
		КодРедактора = СтрЗаменить(КодРедактора, "#value", НачальноеНаполнение);
		
		Форма[ИмяПоля] = КодРедактора;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписиЗавершение(Результат, ДополнительныйПараметр) Экспорт
	
	Если ДополнительныйПараметр.ТекущийФайл = "css" Тогда
		СледующийФайл = "lib";
	ИначеЕсли ДополнительныйПараметр.ТекущийФайл = "lib" Тогда
		СледующийФайл = "mode";
	ИначеЕсли ДополнительныйПараметр.ТекущийФайл = "mode" Тогда
		СледующийФайл = "";
	КонецЕсли;
	
	ЗагрузитьРедактор(ДополнительныйПараметр.Форма, ДополнительныйПараметр.ИмяПоля, 
	ДополнительныйПараметр.НачальноеНаполнение, ДополнительныйПараметр.КВФ, СледующийФайл);
	
КонецПроцедуры