
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//УстановитьВидимость();
	//ДанныеКратко = Запись.Данные;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказатьДанныеПриИзменении(Элемент)
	//ПоказатьДанныеПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьДанныеПриИзмененииНаСервере()
	//УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	//Элементы.Данные.Видимость = ПоказатьДанные;
	//Элементы.ДанныеКратко.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти
