
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьОписаниеКонфигурации(Команда)
	Сообщить("Этот функционал в процессе разработки");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОписаниеКонфигурации(Команда)
	Сообщить("Этот функционал в процессе разработки");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти