
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ЭтаФорма.ТолькоПросмотр = Истина;
	
	ОшибкаОбработки = Запись.Статус = Перечисления.СМП_СтатусыОбработкиСообщений.ОшибкаДоставки
					Или Запись.Статус = Перечисления.СМП_СтатусыОбработкиСообщений.ОшибкаОбработки
					Или Запись.Статус = Перечисления.СМП_СтатусыОбработкиСообщений.ОшибкаОтправки;
	
	Элементы.СообщениеОбОшибке.Видимость = ОшибкаОбработки;
	
КонецПроцедуры

#КонецОбласти
