Перем Манифест Экспорт;

Функция Манифест()
	Манифест = Новый Структура;
	
	Контрагенты = Новый Структура("ПередЗаписью", "ВыполнитьОбработкуКонтрагенты");
	Манифест.Вставить("Контрагенты", Контрагенты);
	
	Организации = Новый Структура("ПередЗаписью", "ВыполнитьОбработкуОрганизаци");
	Манифест.Вставить("Организации", Организации);
	
	Организации = Новый Структура("ПередЗаписью", "ВыполнитьОбработкуНоменклатура");
	Манифест.Вставить("Номенклатура", Организации);
	Возврат Манифест;
КонецФункции

Функция ВыполнитьОбработкуКонтрагенты(Объект1с, ВходящиеДанные) Экспорт
	Объект1с.КонтактнаяИнформация.Очистить();
	
	Для Каждого Строка Из ВходящиеДанные.ТЧ.КонтактнаяИнформация Цикл
		НоваяСтрока = Объект1с.КонтактнаяИнформация.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации[Строка.Тип_До.Значение];
		НоваяСтрока.Вид = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию(Строка.Вид_До.Наименование);
	КонецЦикла;	
КонецФункции

Функция ВыполнитьОбработкуОрганизаци(Объект1с, ВходящиеДанные) Экспорт
	Объект1с.КонтактнаяИнформация.Очистить();
	
	Для Каждого Строка Из ВходящиеДанные.ТЧ.КонтактнаяИнформация Цикл
		НоваяСтрока = Объект1с.КонтактнаяИнформация.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации[Строка.Тип_До.Значение];
		НоваяСтрока.Вид = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию(Строка.Вид_До.Наименование);
	КонецЦикла;	
КонецФункции

Функция ВыполнитьОбработкуНоменклатура(Объект1с, ВходящиеДанные) Экспорт
	ЭтоНовый = НЕ ЗначениеЗаполнено(Объект1с.Ссылка.ВерсияДанных);
	Если Объект1с.ЭтоГруппа Тогда
		НаборЗаписей = РегистрыСведений.ИерархияНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Объект1с.Ссылка);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Номенклатура = Объект1с.Ссылка;
		НоваяЗапись.ПометкаУдаленияГруппы = Объект1с.ПометкаУдаления;
		НоваяЗапись.КартинкаГруппы = ?(Объект1с.ПометкаУдаления, 1, 0);
		
		НаборЗаписей.Записать(Истина);	
	Иначе
		Объект1с.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.БезКатегории;
	КонецЕсли;
	
	Если НЕ ЭтоНовый Тогда
		Объект1с.Наименование = Объект1с.Ссылка.Наименование;
	КонецЕсли;
КонецФункции

Манифест = Манифест();