
&После("ПриОпределенииОбъектовСЗаблокированнымиРеквизитами")
Процедура СМП_ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты)
	
	Объекты.Вставить(Метаданные.Справочники.СМП_УчетныеЗаписиОбменов.ПолноеИмя(), "ПолучитьБлокируемыеРеквизитыОбъекта");
	Объекты.Вставить(Метаданные.Справочники.Конфигурации.ПолноеИмя(), "ПолучитьБлокируемыеРеквизитыОбъекта");
	Объекты.Вставить(Метаданные.Справочники.Объекты.ПолноеИмя(), "ПолучитьБлокируемыеРеквизитыОбъекта");
	Объекты.Вставить(Метаданные.Справочники.Свойства.ПолноеИмя(), "ПолучитьБлокируемыеРеквизитыОбъекта");
	Объекты.Вставить(Метаданные.Справочники.Значения.ПолноеИмя(), "ПолучитьБлокируемыеРеквизитыОбъекта");
	
КонецПроцедуры
