
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет подготовку редактора кода для обработчиков.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, на которой размещены поля обработчиков.
//   ДанныеПолей - Соответствие:
//					* Ключ - Строка - Имя реквизита формы содержащего текст редактора для каждого отдельного обработчика;
//					* Значение - Строка - Текст обработчика для вставки в редактор.
//   КВФ - Строка - Адрес каталога временных файлов.
//
Процедура ЗагрузитьРедактор(Форма, ДанныеПолей, КВФ) Экспорт
	
	КодРедактора = ПодготовитьРедакторКода(КВФ);
	Для Каждого ДанныеПоля Из ДанныеПолей Цикл
		НачальноеНаполнение = СтрЗаменить(ДанныеПоля.Значение, Символы.ПС, "\n");
		НачальноеНаполнение = СтрЗаменить(НачальноеНаполнение, Символы.ВК, "\r");
		НачальноеНаполнение = СтрЗаменить(НачальноеНаполнение, Символы.НПП, "&nbsp");
		НачальноеНаполнение = СтрЗаменить(НачальноеНаполнение, Символы.ВТаб, "&#11");
		НачальноеНаполнение = СтрЗаменить(НачальноеНаполнение, Символы.Таб, "\t");
		
		КодДляВставки = СтрЗаменить(КодРедактора, "#value", НачальноеНаполнение);
		Форма[ДанныеПоля.Ключ] = КодДляВставки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Разворачивает файлы редактора кода.
//
// Параметры:
//   <Параметр1> - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//   <Параметр2> - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Функция ПодготовитьРедакторКода(КаталогВременныхФайлов) 
	
	КодРедактора = "";
	
	НаборМакетов = СМП_РедакторКодаСервер.ПолучитьМакетыРедактора();
	Для Каждого ДанныеМакета Из НаборМакетов Цикл
		
		ИмяФайла = ДанныеМакета.Ключ;
		Макет = ДанныеМакета.Значение;
		
		Если ИмяФайла = "index" Тогда
			
			инвКаталог = СтрЗаменить(КаталогВременныхФайлов, "\", "/");
			Макет.ЗаменитьСтроку(6, "<link rel='stylesheet' href='file:///" + инвКаталог + "style1c.css'>");
			Макет.ЗаменитьСтроку(7, "<script type='text/javascript' src='file:///" + инвКаталог + "lib1c.js'></script>");
			Макет.ЗаменитьСтроку(8, "<script type='text/javascript' src='file:///" + инвКаталог + "mode1c.js'></script>");
			КодРедактора = Макет.ПолучитьТекст();
			
		Иначе
			
			Макет.НачатьЗапись(, КаталогВременныхФайлов + ИмяФайла);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат КодРедактора;
	
КонецФункции //ПодготовитьРедакторКода

#КонецОбласти
