
Функция ЗаполнитьРеквизитыЗаписиРегистраОчередей(Запись) Экспорт
	
	Если Не ЗначениеЗаполнено(Запись.ТаймШтамп) Тогда
		Запись.ТаймШтамп = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьДанныеВJSON_Расширенная(Данные, ТолькоСсылки = Истина) Экспорт
	
	Конвертер = Обработки.леJSONКонвертер4.Создать();
	
	Возврат Конвертер.ЗаписатьJSON_Расширенная(Данные, ТолькоСсылки);
	
КонецФункции

Функция ПрочитатьДанныеИзJSON_Расширенная(СтрокаJSON, ИменаПолейСДатами = Неопределено) Экспорт
	
	Конвертер = Обработки.леJSONКонвертер4.Создать();
	
	Возврат Конвертер.ПрочитатьJSON_Расширенная(СтрокаJSON, ИменаПолейСДатами)
	
КонецФункции

Функция ОтправитьДанные(Данные) Экспорт
	
	ИсходящиеДанные = ЗаписатьДанныеВJSON_Расширенная(Данные);
	
	Выборка = СМП_ОнлайнОбменОбщегоНазначения.ПолучитьНастройки();
	МассивЗаписей = Новый Массив;
	
	Транспорт = Обработки.леТранспорт.Создать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Найти(Выборка.СтрокаПодключения, "ftp") Тогда
			Транспорт.ОтправитьПоFTP(Выборка.СтрокаПодключения, Данные);
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.СтрокаПодключения) Тогда
			
			ПараметрыАвторизации = Новый Структура;
			ПараметрыАвторизации.Вставить("Логин",  "Логин");
			ПараметрыАвторизации.Вставить("Пароль", "Пароль");
			
			Ответ = леКоннекторHTTP.ОтправитьJSON(ИсходящиеДанные, Выборка.СтрокаПодключения, ПараметрыАвторизации);
			Если Ответ.КодСостояния = 200 Тогда
			Иначе
				Возврат Ответ.Ответ.ПолучитьТелоКакСтроку();
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Выборка.КаталогОбмена) Тогда
			СохранитьВКаталог(ИсходящиеДанные, Выборка.КаталогОбмена, Выборка.ПрефиксФайловЭтойБазы, Выборка.ПрефиксФайлов);
		Иначе
		КонецЕсли
		
	КонецЦикла;
	
КонецФункции

Функция СохранитьВКаталог(ИсходящиеДанные, КаталогДляСохранения, ПрефиксФайловЭтойБазы, ПрефиксФайлов) Экспорт
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ИсходящиеДанные);
	ИмяФайла = СтрШаблон("from_%1_to_%2_%3", ПрефиксФайловЭтойБазы, ПрефиксФайлов, ТекущаяУниверсальнаяДатаВМиллисекундах());
	КаталогОбмена = ?(Прав(КаталогДляСохранения, 1) = "\", КаталогДляСохранения, КаталогДляСохранения + "\");
	
	ТекстовыйДокумент.Записать(КаталогОбмена + ИмяФайла + ".ledata");
	
КонецФункции
