
// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Имя");
	Результат.Добавить("Синоним");
	Результат.Добавить("Комментарий");
	Результат.Добавить("Тип");
	Результат.Добавить("Иерархический");
	Результат.Добавить("ВидИерархии");
	Результат.Добавить("ОграничиватьКоличествоУровней");
	Результат.Добавить("КоличествоУровней");
	Результат.Добавить("СерииКодов");
	Результат.Добавить("КонтрольУникальности");
	Результат.Добавить("АвтоНумерация");
	Результат.Добавить("Периодичность");
	Результат.Добавить("Подчиненный");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()