
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Параметры.ЗначенияЗаполнения.Свойство("КонфигурацияИсточник", КонфигурацияИсточник);
	КонецЕсли;

	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Редактор кода
	#Если ВебКлиент Тогда
		
	#Иначе
		
		НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("ЗагрузитьРедакторКода", ЭтотОбъект));
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	КонфигурацияИсточник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "Источник");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Редактор кода
	//Объект.АлгоритмПередВыгрузкойОбъекта = Элементы.АлгоритмПередВыгрузкойОбъектаРедактор.Документ.defaultView.editor.getValue();
	//Объект.АлгоритмПриВыгрузкеОбъекта = Элементы.АлгоритмПриВыгрузкеОбъектаРедактор.Документ.defaultView.editor.getValue();
	//Объект.АлгоритмПослеВыгрузкиОбъекта = Элементы.АлгоритмПослеВыгрузкиОбъектаРедактор.Документ.defaultView.editor.getValue();
	//Объект.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена = Элементы.АлгоритмПослеВыгрузкиОбъектаВФайлОбменаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПоследовательностьПолейПоиска = Элементы.АлгоритмПоследовательностьПолейПоискаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПередЗагрузкойОбъекта = Элементы.АлгоритмПередЗагрузкойОбъектаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПриЗагрузкеОбъекта = Элементы.АлгоритмПриЗагрузкеОбъектаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПослеЗагрузкиОбъекта = Элементы.АлгоритмПослеЗагрузкиОбъектаРедактор.Документ.defaultView.editor.getValue();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура ПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПриемникНачалоВыбораЗавершение", ЭтотОбъект);
	мПараметрыФормы = Новый Структура("ВидОбъектаОбмена", ПредопределенноеЗначение("Перечисление.СМП_ВидыОбъектовОбмена.ОбъектМетаданных"));
	ОткрытьФорму("ОбщаяФорма.СМП_ФормаВыбораПриемника", мПараметрыФормы, Элемент,,,, Оповещение);
	
КонецПроцедуры

// Обработчик оповещения выбора приемника.
//
&НаКлиенте
Процедура ПриемникНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		Объект.Приемник = РезультатЗакрытия.Имя;
		Если НЕ Модифицированность Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ПриемникНачалоВыбораЗавершение

&НаКлиенте
Процедура СинхронизироватьПоИдентификаторуПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет установку видимости и доступности элементов формы.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Элементы.ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли.Доступность = Объект.СинхронизироватьПоИдентификатору;
	Элементы.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD.Доступность = Объект.СинхронизироватьПоИдентификатору;
	
КонецПроцедуры //УстановитьВидимость

// Редактор кода
&НаКлиенте
Процедура ЗагрузитьРедакторКода(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт
	
	ДанныеПолей = Новый Соответствие;
	//ДанныеПолей.Вставить("АлгоритмПередВыгрузкойОбъектаРедактор", Объект.АлгоритмПередВыгрузкойОбъекта);
	//ДанныеПолей.Вставить("АлгоритмПриВыгрузкеОбъектаРедактор", Объект.АлгоритмПриВыгрузкеОбъекта);
	//ДанныеПолей.Вставить("АлгоритмПослеВыгрузкиОбъектаРедактор", Объект.АлгоритмПослеВыгрузкиОбъекта);
	//ДанныеПолей.Вставить("АлгоритмПослеВыгрузкиОбъектаВФайлОбменаРедактор");
	ДанныеПолей.Вставить("АлгоритмПоследовательностьПолейПоискаРедактор", Объект.АлгоритмПоследовательностьПолейПоиска);
	ДанныеПолей.Вставить("АлгоритмПередЗагрузкойОбъектаРедактор", Объект.АлгоритмПередЗагрузкойОбъекта);
	ДанныеПолей.Вставить("АлгоритмПриЗагрузкеОбъектаРедактор", Объект.АлгоритмПриЗагрузкеОбъекта);
	ДанныеПолей.Вставить("АлгоритмПослеЗагрузкиОбъектаРедактор", Объект.АлгоритмПослеЗагрузкиОбъекта);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтотОбъект, ДанныеПолей, ИмяКаталогаВременныхФайлов);
	
КонецПроцедуры

#КонецОбласти
