
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПолей = Новый Структура("ОбъектИсточник, ОбъектПриемник", "Источник", "Приемник");
	РеквизитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, СтруктураПолей);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Редактор кода
	НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("ЗагрузитьРедакторКода", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Редактор кода
	Объект.АлгоритмПередОбработкойВыгрузки = Элементы.АлгоритмПередОбработкойВыгрузкиРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПередВыгрузкойСвойства = Элементы.АлгоритмПередВыгрузкойСвойстваРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПриВыгрузкеСвойства = Элементы.АлгоритмПриВыгрузкеСвойстваРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПослеВыгрузкиСвойства = Элементы.АлгоритмПослеВыгрузкиСвойстваРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПослеОбработкиВыгрузки = Элементы.АлгоритмПослеОбработкиВыгрузкиРедактор.Документ.defaultView.editor.getValue();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура ПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ОбъектПриемник) Тогда
		Оповещение = Новый ОписаниеОповещения("ПриемникНачалоВыбораЗавершение", ЭтотОбъект);
		мПараметрыФормы = Новый Структура("ВидОбъектаОбмена, ИмяРодительскогоОбъекта",
		ПредопределенноеЗначение("Перечисление.СМП_ВидыОбъектовОбмена.ГруппаСвойствОбъекта"), ОбъектПриемник);
		ОткрытьФорму("ОбщаяФорма.СМП_ФормаВыбораПриемника", мПараметрыФормы, Элемент,,,, Оповещение);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик оповещения.
//
&НаКлиенте
Процедура ПриемникНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		Объект.Приемник = РезультатЗакрытия;
		Если НЕ Модифицированность Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ПриемникНачалоВыбораЗавершение

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Редактор кода
&НаКлиенте
Процедура ЗагрузитьРедакторКода(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт
	
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПередОбработкойВыгрузкиРедактор", Объект.АлгоритмПередОбработкойВыгрузки, ИмяКаталогаВременныхФайлов);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПередВыгрузкойСвойстваРедактор", Объект.АлгоритмПередВыгрузкойСвойства, ИмяКаталогаВременныхФайлов);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПриВыгрузкеСвойстваРедактор", Объект.АлгоритмПриВыгрузкеСвойства, ИмяКаталогаВременныхФайлов);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПослеВыгрузкиСвойстваРедактор", Объект.АлгоритмПослеВыгрузкиСвойства, ИмяКаталогаВременныхФайлов);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПослеОбработкиВыгрузкиРедактор", Объект.АлгоритмПослеОбработкиВыгрузки, ИмяКаталогаВременныхФайлов);
	
КонецПроцедуры

#КонецОбласти
