
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ПустаяСтрока(Запись.ЭлементСправочника) Тогда
		ЭлементСсылка = ЗначениеИзСтрокиВнутр(Запись.ЭлементСправочника);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЭлементСсылка) Тогда
		ТекущийОбъект.ЭлементСправочника = ЗначениеВСтрокуВнутр(ЭлементСсылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти