
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ЗапуститьОбработкуСообщения(Элементы.Список.ТекущиеДанные.УчетнаяЗаписьОбмена, Элементы.Список.ТекущиеДанные.УникальныйИдентификатор);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Запуск обработки сообщения.
//
// Параметры:
//   <Параметр1> - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//   <Параметр2> - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервереБезКонтекста
Процедура ЗапуститьОбработкуСообщения(УчетнаяЗапись, ИдентификаторСообщения) 
	
	СМП_ОнлайнОбмен.ОбработатьВходящиеСообщения(, УчетнаяЗапись, ИдентификаторСообщения,, Истина);
	
	//// Запуск через фоновое задание:
	//мПараметры = Новый Массив(5);
	//мПараметры.Установить(0, Неопределено);
	//мПараметры.Установить(1, УчетнаяЗапись);
	//мПараметры.Установить(2, ИдентификаторСообщения); // уид конкретного сообщения
	//мПараметры.Установить(3, Неопределено);
	//мПараметры.Установить(4, Истина);
	//
	//ИмяОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "Наименование");
	//ИмяФЗ = СтрШаблон("Обмен ""%1"": обработка входящих сообщений", ИмяОбмена);
	//
	//ФЗ = ФоновыеЗадания.Выполнить("СМП_ОнлайнОбмен.ОбработатьВходящиеСообщения", мПараметры, "Отладка", ИмяФЗ);
	
КонецПроцедуры //ЗапуститьОбработкуСообщения

#КонецОбласти

